<p>En esta secci&oacute;n respondo a las preguntas frecuentes (y no tan frecuentes) que surgen respecto al blog.</p>
<h2>&iquest;Qu&eacute; es esto?</h2>
<p>&iexcl;Adrianist&aacute;n! Se trata del blog en espa&ntilde;ol donde me dedico a hablar de cosas poco interesantes pero que me entretienen. Principalmente de programaci&oacute;n, pero tambi&eacute;n hay algo de filosof&iacute;a, f&iacute;sica y <em>Rep&uacute;blica de Adrianist&aacute;n</em>.</p>
<h2>&iquest;Qui&eacute;n eres?</h2>
<p>Soy Adri&aacute;n Arroyo Calle, soy de Valladolid (Castilla). Actualmente estudio Ingenier&iacute;a Inform&aacute;tica en la Universidad de Valladolid. Creo que el mundo es impresionante y me gustar&iacute;a conocer todo sobre &eacute;l. Me gusta mucho viajar, conocer datos est&uacute;pidos</p>
<h2>&iquest;Cu&aacute;l es tu lenguaje de programaci&oacute;n favorito?</h2>
<p>La verdad es que no tengo un lenguaje favorito, aunque ahora mismo el lenguaje en el que soy m&aacute;s productivo es JavaScript. Tambi&eacute;n he programado en Java, Python, Rust, C, C#, SQL, C++ (hace tiempo) y siempre trato de ir aprendiendo cosas nuevas (Haskell, Prolog).</p>
<h2>&iquest;D&oacute;nde trabajas?</h2>
<p>Actualmente estudio <a href="http://inf.uva.es">Ingenier&iacute;a Inform&aacute;tica en la UVa</a>. Tambi&eacute;n soy miembro de la asociaci&oacute;n <a href="http://bestvalladolid.org">BEST Valladolid</a>.</p>
<h2>&iquest;Tienes m&aacute;s blogs?</h2>
<p>S&iacute;, tambi&eacute;n escribo en Phaser.js Hispano, aunque no escribo tanto all&iacute;</p>
<h2>&iquest;Qu&eacute; m&uacute;sica te gusta?</h2>
<p>La verdad es que me gusta la m&uacute;sica en general, sin demasiadas distinciones. Sin embargo, si tengo que elegir me quedar&iacute;a con mis bandas sonoras: Ennio Morricone, Vangelis, Alexandre Desplat,&nbsp; Yann Tiersen, etc (John Williams no). Tambi&eacute;n me gusta bastante Mike Oldfield y el g&eacute;nero del Latin Jazz. Pero en mi biblioteca musical hay de todo: Nino Bravo, Nina Simone, Nach, Paco Pil, Philip Glass, Pink Floyd, Bach, Johnny Cash, Sole&aacute; Morente, ... Muchas veces depende del momento.</p>
<h2>&iquest;Pel&iacute;cula preferida?</h2>
<p>Algunas de mis pel&iacute;culas favoritas son: <em>El Sentido de la Vida</em> de los Monty Python, <em>La Naranja Mec&aacute;nica</em>, <em>Intocable</em>, <em>The Royal Tenenbaums</em>, <em>&iexcl;Bienvenido Mr. Marshall!</em> y <em>Qu&eacute; bello es vivir</em>. Tambi&eacute;n fui j<a href="https://blog.adrianistan.eu/2017/11/12/cronica-la-62-seminci/">urado joven del festival de cine de Valladolid</a>, la SEMINCI.</p>
<h2>&iquest;Vim o Emacs?</h2>
<p>Vim claramente (&iquest;o acaso ten&eacute;is 20 dedos en cada mano?). Aunque suelo programar en Visual Studio Code.</p>
<h2>&iquest;Windows o Linux?</h2>
<p>Suelo trabajar con Linux (concretamente con Debian) porque me gusta m&aacute;s, pero he de reconocer que Windows no es tan mal sistema operativo.</p>
<h2>&iquest;Qu&eacute; escritorio usas en Linux?</h2>
<p>GNOME 3, con algunas extensiones por defecto. Lo considero uno de los escritorios m&aacute;s productivos que existen actualmente y con buen dise&ntilde;o.</p>
<h2>&iquest;Espacios o tabuladores?</h2>
<p>Tabuladores que en el editor se convierten a espacios</p>
<h2>&iquest;En qui&eacute;n te inspiras?</h2>
<p>Aunque intento seguir mi propio camino, he de decir que hay ciertos personajes que me han inspirado durante mi vida. Richard Feynman, Bertrand Russell, mis compa&ntilde;eros de BEST Valladolid, ...</p>
<h2>&iquest;Puedo publicar en Adrianist&aacute;n?</h2>
<p>S&iacute;, claro, cualquiera puede aportar. Si eres una empresa, tendr&aacute;s que pagar. C<a href="https://blog.adrianistan.eu/contacto/">ontacta conmigo para m&aacute;s detalles.</a></p>
<h2>&iquest;Puedo anunciarme en Adrianist&aacute;n?</h2>
<p>S&iacute; por supuesto. <a href="https://blog.adrianistan.eu/contacto/">Contacta conmigo</a> y seg&uacute;n el tama&ntilde;o/tipo del anuncio veremos el precio.</p>
<h2>&iquest;Puedes trabajar para m&iacute;?</h2>
<p>Actualmente estudio y actualmente no estoy buscando trabajo</p>
<h2>&iquest;Qu&eacute; fue de Divel?</h2>
<p>Fue como empec&eacute; con la programaci&oacute;n, mi <em>empresa</em>. Actualmente ya no uso m&aacute;s ese pseud&oacute;nimo para publicar mis programas.</p>
<h2>&iquest;Qu&eacute; pas&oacute; con NextDivel?</h2>
<p>El objetivo de NextDivel era ver hasta donde pod&iacute;a llegar programando un sistema operativo de cero. Ahora que he estudiado m&aacute;s el funcionamiento de los sistemas operativos solo puedo decir que NextDivel hace demasiadas pocas cosas y las que hace, no las hace bien del todo.</p>
<h2>&iquest;Cada cu&aacute;nto publicas?</h2>
<p>En Adrianist&aacute;n no hay un horario fijo de publicaciones. A veces hay publicaciones muy seguidas unas de otras y luego un largo tiempo sin ellas. Realmente todo depende de si tengo algo interesante que contar y de si tengo tiempo y ganas para ello.</p>
<h2>&iquest;Cu&aacute;ndo vas a hacer un post sobre X?</h2>
<p>Cuando sea interesante para m&iacute; poder contaros algo sobre X. No suelo seguir demasiado las modas tecnol&oacute;gicas, as&iacute; que el blog estar&aacute; condenado siempre a recibir menos visitas que otros.</p>
<h2>&iquest;Podemos quedar y charlar?</h2>
<p>S&iacute;, claro. Vivo en Valladolid y normalmente puedo quedar. Una meta que me puse hace tiempo era la de conocer cada d&iacute;a a una persona distinta, algo que nunca ha ocurrido, pero por algo se les llama metas. Si hablas ingl&eacute;s bien, mejor, as&iacute; puedo practicar.</p>
<h2>&iexcl;Tengo m&aacute;s preguntas!</h2>
<p>&iexcl;Bien! Usa el <a href="https://blog.adrianistan.eu/contacto/">formulario de contacto</a> y hablamos.</p>