<p>Si tomas los cuatro n&uacute;meros primos consecutivos empezando con 17, los elevas al cuadrado y los sumas, &iquest;qu&eacute; te da?</p>
<p style="text-align: center;">17&sup2;+19&sup2;+23&sup2;+29&sup2; = 2020</p>
<p style="text-align: left;">&iexcl;Efectivamente! 2020. &iexcl;Felicidades a todos los lectores del blog que me acompa&ntilde;&aacute;is! S&eacute; que ya sois unos cuantos. Espero que el a&ntilde;o que viene podamos seguir hablando aqu&iacute; de programaci&oacute;n, inteligencia artificial, computaci&oacute;n y lo que surja.</p>
<p style="text-align: left;">Antes de dar paso a la muerte definitiva a Python 2.7 vamos a repasar las principales estad&iacute;sticas del blog.</p>
<p style="text-align: left;">Este a&ntilde;o hab&eacute;is visitado el blog la friolera de <strong>44.864 usuarios</strong> en <strong>58.116 sesiones</strong>, un claro aumento respecto a 2018 (39.328 usuarios y 51.731 sesiones).</p>
<h2 style="text-align: left;">Pa&iacute;ses</h2>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://files.adrianistan.eu/Paises2019.png" alt="" />Los tres primeros puestos son inamovibles, aunque Espa&ntilde;a cada vez representa menos porcentaje de visitas. En el cuarto puesto Chile ha adelantado a Argentina, aunque siguen muy cerca el uno del otro. Los pa&iacute;ses europeos Francia y Reino Unido salen de la lista, tienen muchas menos visitas este a&ntilde;o.&nbsp;</p>
<p>Las ciudades que m&aacute;s visitan mi blog son: Madrid, Santiago (de Chile), Bogot&aacute;, Ciudad de M&eacute;xico, Barcelona, Buenos Aires y Medell&iacute;n.</p>
<h2>Tecnolog&iacute;a</h2>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://files.adrianistan.eu/Navegador2019.png" alt="" /></p>
<p>Resultados muy similares al a&ntilde;o pasado</p>
<h2 style="text-align: left;">Art&iacute;culos</h2>
<p>Y el art&iacute;culo m&aacute;s visitado en 2019 es:</p>
<p style="text-align: center;"><a href="../../estadistica-python-media-mediana-varianza-percentiles-parte-iii"><span class="_GApu  _GAl ACTION-drilldown TARGET-0-0 ">Estad&iacute;stica en Python: media, mediana, varianza, percentiles (Parte III)</span></a></p>
<p style="text-align: left;"><span class="_GApu  _GAl ACTION-drilldown TARGET-0-0 ">No me voy a extender mucho en esto porque con la Ley de Zipf se vieron los art&iacute;culos m&aacute;s le&iacute;dos</span></p>
<p style="text-align: left;"><span class="_GApu  _GAl ACTION-drilldown TARGET-0-0 ">Sin extenderme mucho m&aacute;s, &iexcl;os deseo feliz a&ntilde;o a todos!</span></p>