<p><iframe src="https://www.youtube.com/embed/eh2fpnwAPC0" width="560" height="315" frameborder="0" allowfullscreen=""></iframe></p>
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>&iexcl;Feliz Navidad a todos! Que los problemas de vuestra rutina no os amarguen el carb&oacute;n de az&uacute;car que os merec&eacute;is.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>Estas fechas adem&aacute;s son apropiadas para hacer un repaso de lo que ha sido el blog durante 2018. As&iacute; que voy a abrir Google Analytics y veamos que ha ocurrido.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:heading -->
<h2>Usuarios</h2>
<!-- /wp:heading -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>Este a&ntilde;o hemos batido r&eacute;cord, con <strong>39.328 usuarios &uacute;nicos</strong> contabilizados, en <strong>51.731 sesiones</strong>. Esto es casi el doble que el a&ntilde;o pasado en ambas m&eacute;tricas.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:image {"id":1694} -->
<figure class="wp-block-image"><img class="wp-image-1694" src="https://files.adrianistan.eu/Analytics2018.png" alt="" /></figure>
<!-- /wp:image -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>Respecto a vuestra edad, cada vez sois m&aacute;s j&oacute;venes. Ha habido un crecimiento relativo importante en la categor&iacute;a 18-24 y un retroceso en los otros grupos de edad, pero en general todos los grupos tienen m&aacute;s lectores. Respecto a vuestro sexo, este a&ntilde;o ha habido un 18,65% de mujeres, respecto al a&ntilde;o anterior de 12,3%. Recordad que todos estos datos demogr&aacute;ficos no son nada precisos y es una estimaci&oacute;n que hace Google Analytics.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>En cuanto a vuestros intereses, bastante similar a otros a&ntilde;os, usuarios tecnol&oacute;gicos, bastante m&aacute;s software. Las categor&iacute;as que m&aacute;s han crecido este a&ntilde;o son <strong>Enterprise Software</strong> y <strong>Science/Mathematics</strong>, curioso.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>La mayor&iacute;a ten&eacute;is configurado como idioma el ingl&eacute;s o el castellano, con el tercer idioma siendo el franc&eacute;s (pero a mucha distancia).</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>En cuanto a vuestra ubicaci&oacute;n, la mayor&iacute;a segu&iacute;s siendo de Espa&ntilde;a, aunque latinoam&eacute;rica ha subido este a&ntilde;o bastante, algo que me ha alegrado mucho. El pa&iacute;s que m&aacute;s ha aumentado su porcentaje de visitas respecto al a&ntilde;o pasado a sido <del>Nueva Espa&ntilde;a</del> M&eacute;xico. Destacar que aunque en Venezuela y Estados Unidos ha aumentado el n&uacute;mero de lectores, lo ha hecho a un ritmo tan bajo, que su porcentaje de lectores ha bajado, &iquest;tendr&aacute; que ver la situaci&oacute;n pol&iacute;tica? Del Top 15 tambi&eacute;n se&ntilde;alar que Reino Unido es el &uacute;nico pa&iacute;s donde ha bajado el n&uacute;mero de lectores. Y este a&ntilde;o se han recibido visitas desde 114 territorios diferentes del mundo.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:image {"id":1695} -->
<figure class="wp-block-image"><img class="wp-image-1695" src="https://files.adrianistan.eu/Paises2018.png" alt="" /></figure>
<!-- /wp:image -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>En cuanto a ciudades, la mayor&iacute;a ven&iacute;s de la ciudad con el mejor agua del mundo, los mejores atascos, las mejores cervezas y las mejores catedrales: Madrid. Le sigue Barcelona y en tercer lugar, Santiago de Chile. El top 10 lo completan: Bogot&aacute;, Ciudad de M&eacute;xico, Buenos Aires, Valencia, La Victoria, Medell&iacute;n y Sevilla. Esta vez, mi propia ciudad, Valladolid, no est&aacute; en el top 10.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:image {"id":1697} -->
<figure class="wp-block-image"><img class="wp-image-1697" src="https://files.adrianistan.eu/Navegadores2018-1024x361.png" alt="" /></figure>
<!-- /wp:image -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>Se confirma la tendencia de que Chrome es el navegador m&aacute;s usado. El segundo es Firefox y el tercero es Safari. Como cosas curiosas, Edge ha superado a Internet Explorer y hay m&aacute;s usuarios de Opera que de Edge.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:image {"id":1698} -->
<figure class="wp-block-image"><img class="wp-image-1698" src="https://files.adrianistan.eu/SistemaOperativo2018-1024x539.png" alt="" /></figure>
<!-- /wp:image -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>En cuanto a sistemas operativos se vuelve a ver una dominancia de Windows y Android. Por otro lado me gustar&iacute;a conocer a los que han entrado desde BeOS y desde Tizen.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:heading -->
<h2>&iquest;C&oacute;mo lleg&aacute;is a este blog?</h2>
<!-- /wp:heading -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>Ahora vamos a ver como acced&eacute;is a este blog. La gran mayor&iacute;a lleg&aacute;is a trav&eacute;s de un buscador, principalmente Google aunque tambi&eacute;n Yahoo, Ecosia, Bing, Ask, DuckDuckGo y Yandex.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>De los que lleg&aacute;is a trav&eacute;s de otras p&aacute;ginas, la mayor&iacute;a ven&iacute;s de Men&eacute;ame, que este a&ntilde;o se ha portado muy bien con el blog. La siguiente web es GitHub, ya que enlaza al blog en varios sitios (tutoriales de Rust, repos muy curiosos, &iexcl;e incluso desde issues!). Menci&oacute;n especial a las tres instancias de Moodle de las que tengo constancia que enlazan a mi blog (una de un instituto de la Rep&uacute;blica Checa, muy curioso). Bastantes visitas tambien desde Reddit.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>Tambi&eacute;n hay qui&eacute;n nos sigue desde el <a href="https://t.me/adrianistan">canal de Telegram,</a> un <a href="https://blog.adrianistan.eu/feed/">lector RSS</a>, redes sociales y el correo (pod&eacute;is encontrar m&aacute;s informaci&oacute;n en la barra lateral).</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:heading -->
<h2>Lo m&aacute;s visto</h2>
<!-- /wp:heading -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>Finalmente, lo mejor para el final, &iquest;qu&eacute; contenido es el m&aacute;s popular del blog?</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>He de decir que esto ha sido una total sorpresa, se trata de un art&iacute;culo que no tuvo apenas repercusi&oacute;n cuando lo publiqu&eacute;, pero parece que much&iacute;sima gente ha llegado a &eacute;l a trav&eacute;s de Google. Se trata de...</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph {"align":"center"} -->
<p style="text-align: center;"><a href="https://blog.adrianistan.eu/2017/11/04/estadistica-python-media-mediana-varianza-percentiles-parte-iii/">Estad&iacute;stica en Python: media, mediana, varianza, percentiles (Parte III)<br /></a></p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>La verdad es que me ha sorprendido mucho, pero al parecer mucha gente desea hacer estad&iacute;stica en Python, pero curiosamente no es el primer art&iacute;culo de la serie que hice.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>El segundo art&iacute;culo ha sido: <a href="https://blog.adrianistan.eu/2018/09/19/ipfs-el-futuro-de-la-web-descentralizada/">IPFS, el futuro de la web descentralizada,</a> que tuvo bastante repercusi&oacute;n e inter&eacute;s por vuestra parte desde el principio.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>El tercer art&iacute;culo con m&aacute;s visitas ha sido: <a href="https://blog.adrianistan.eu/2017/10/31/estadistica-python-pandas-numpy-scipy-parte-i/">Estad&iacute;stica en Python: Parte 1</a> Como v&eacute;is, la estad&iacute;stica ha tenido bastante &eacute;xito en el blog.</p>
<!-- /wp:paragraph -->
<p>&nbsp;</p>
<!-- wp:paragraph -->
<p>Sin nada m&aacute;s, me despido. &iexcl;Muchas gracias a todos los que segu&iacute;s el blog! Este a&ntilde;o cada vez sois m&aacute;s, y est&aacute;is m&aacute;s presentes. Yo me voy a ver <em>&iexcl;Qu&eacute; bello es vivir!</em> otra vez, que es una pel&iacute;cula que me gusta mucho.</p>
<!-- /wp:paragraph -->