<p>El pasado 19 de octubre, tuvo lugar en la ciudad de Le&oacute;n el evento <a href="https://linuxytapas.wordpress.com/">Linux y Tapas 2019</a>. Era mi primera vez en este evento y encima, adem&aacute;s decid&iacute; dar una ponencia. El evento en s&iacute; me gust&oacute; mucho. Primero se queda en la catedral de Le&oacute;n y luego nos dirigimos todos juntos al barrio h&uacute;medo a comer a base de tapas. Nunca hab&iacute;a estado en el barrio h&uacute;medo y me sorprendi&oacute; muy gratamente. Durante este tiempo puedes hablar con el resto de asistentes. Conoc&iacute; a mucha gente interesante y pudimos hablar de gran cantidad de temas diferentes, eso s&iacute;, en su mayor&iacute;a temas que no podr&iacute;as sacar en conversaciones con tus amigos no t&eacute;cnicos.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://files.adrianistan.eu/LyT.png" alt="" width="300" /></p>
<p>Posteriormente fueron las charlas en la<a href="https://www.sierrapambley.org/"> fundaci&oacute;n Sierra Pambley</a>, un sitio muy bien situado. All&iacute; tuvimos charlas muy interesantes sobre la educaci&oacute;n (hubo dos, aunque totalmente diferentes), sobre ciberseguridad y una sobre Raspberry Pi a cargo de <a href="https://www.atareao.es/">El Atareao</a>, a qui&eacute;n se le premi&oacute; por su acitividad en las redes y en el software libre durante este tiempo. Tambi&eacute;n estuvo mi charla, la cu&aacute;l fue grabada y os dejo aqu&iacute; para que la disfrut&eacute;is. Pod&eacute;is descargar el fichero ODP en <a href="http://ppt.adrianistan.eu/#Web%203%200:%20redes%20descentralizadas:%20Linux%20y%20Tapas%202019">mi repositorio de presentaciones</a>.</p>
<p>Una vez m&aacute;s, muchas gracias a todos los participantes y organizadores del evento. &iexcl;Espero que nos veamos el a&ntilde;o que viene!</p>
<p style="text-align: center;"><iframe src="https://www.youtube.com/embed/uxOhmSSV-Q0" width="560" height="315" frameborder="0" allowfullscreen=""></iframe></p>
<p><a href="http://ppt.adrianistan.eu/#Web%203%200:%20redes%20descentralizadas:%20Linux%20y%20Tapas%202019">Ver presentaci&oacute;n en mi repositorio</a></p>