<blockquote>Este art&iacute;culo es bastante extenso. Si te interesan los detalles m&aacute;s t&eacute;cnicos puedes ir al final.</blockquote>
<p><br />Nacieron en la primera mitad del siglo XX. Originalmente, estas primeras tarjetas no eran m&aacute;s que una l&iacute;nea de cr&eacute;dito de un determinado establecimiento. En 1924 por ejemplo, General Petroleum Corporation emite una tarjeta para poder adquirir gasolina. En realidad, lo que suced&iacute;a al usar esa tarjeta era que contra&iacute;amos una deuda con la compa&ntilde;&iacute;a, que posteriormente hab&iacute;a que pagar en efectivo. De este modo, funcionaban de forma similar a como cuando dejamos que nos apunten algo en la cuenta del bar.<br /><br />Esto cambi&oacute; en 1949, cuando Franck McNamara estaba cenando con unos amigos y discutiendo precisamente sobre este tipo de tarjetas. Finalmente al llegar a la hora de pagar, McNamara pudo comprobar que se hab&iacute;a dejado la cartera en casa. Tuvo que llamar a su mujer para que le llevase el dinero. Pas&oacute; tal verg&uuml;enza que se propuso acabar para siempre con este tipo de situaciones. As&iacute; es como naci&oacute; <strong>Diners Club</strong>, la primera compa&ntilde;&iacute;a de tarjetas de cr&eacute;dito del mundo.<br /><br /><a href="https://files.adrianistan.eu/FrankXMcNamara.jpg"><img class="wp-image-960 size-full" src="https://files.adrianistan.eu/FrankXMcNamara.jpg" alt="" width="300" height="285" /></a> Frank X. McNamara<br /><br /><a href="https://files.adrianistan.eu/DinersClub.jpg"><img class="size-large wp-image-961" src="https://files.adrianistan.eu/DinersClub-1024x683.jpg" alt="" width="840" height="560" /></a> Una de las primeras tarjetas Diners Club<br /><br />Otros dicen que no llam&oacute; a su mujer sino que sali&oacute; del aprieto dando su tarjeta de visita y anotando la cantidad debida. Sea cual sea la historia verdadera, lo cierto es que el sistema de funcionamiento de una <strong>tarjeta de cr&eacute;dito</strong> es ese. Nosotros cuando pagamos con una tarjeta de este tipo estamos emitiendo deuda, que a final de mes o cuando m&aacute;s nos convenga, pagamos &iacute;ntegramente o a plazos. Diners cobraba comisiones de mantenimiento a los poseedores de las tarjetas y comisiones por transacci&oacute;n a los establecimientos que las admit&iacute;an. Esta es la principal diferencia respecto a las <strong>tarjetas de d&eacute;bito</strong> y las <strong>tarjetas prepago</strong>.<br /><br /><a href="https://files.adrianistan.eu/BankAmericard.jpg"><img class="size-full wp-image-962" src="https://files.adrianistan.eu/BankAmericard.jpg" alt="" width="500" height="333" /></a> Logotipos en un establecimiento de Master Charge (actual MasterCard) y BankAmericard (actual VISA)<br /><br />A partir de ese momento empiezan a surgir m&aacute;s compa&ntilde;&iacute;as, <strong>Bank AmeriCard</strong> o <strong>Master Charge</strong> (VISA y MasterCard actualmente). En Espa&ntilde;a se aceptaron tarjetas de cr&eacute;dito por primera vez en el a&ntilde;o 1954 y por aquel entonces eran simples tarjetas de cart&oacute;n con un n&uacute;mero y su titular, que los hoteles y restaurantes de la &eacute;poca anotaban para posteriormente reclamar el pago a <strong>Diners</strong>. La primera tarjeta emitida por un banco espa&ntilde;ol no llegar&iacute;a hasta 1978, por el Banco de Bilbao y se trataba de una AmeriCard. Las tarjetas de cr&eacute;dito son el tipo de tarjetas m&aacute;s admitidas en el mundo y suelen llevar asociadas ventajas tales como seguros, programas de puntos, ... Al pasarnos una factura a final de mes es m&aacute;s f&aacute;cil saber cuanto hemos gastado en un mes. Sin embargo estas tarjetas tienen un gran peligro. Nos dejan a nuestra disposici&oacute;n una gran cantidad de dinero, y si no somos capaces de pagar las cuotas a tiempo podemos enfrentarnos a unos intereses de devoluci&oacute;n en la mayor&iacute;a de los casos de dos cifras.<br /><br /><a href="https://files.adrianistan.eu/BilbaoVISA.jpg"><img class="size-large wp-image-963" src="https://files.adrianistan.eu/BilbaoVISA-1024x416.jpg" alt="" width="840" height="341" /></a> Las primeras tarjetas de cr&eacute;dito emitidas en Espa&ntilde;a fueron las BankAmericard del Banco de Bilbao<br /><br />Como vemos, las tarjetas de cr&eacute;dito no necesitaban ninguna tecnolog&iacute;a en especial para funcionar, las de d&eacute;bito y las prepago, s&iacute; que lo necesitan. No obstante, todas las tarjetas de cr&eacute;dito hoy en d&iacute;a usan tecnolog&iacute;a, de hecho existen tarjetas que operan en varios modos, cr&eacute;dito y d&eacute;bito. &iquest;C&oacute;mo funcionan las tarjetas de d&eacute;bito?<br /><br />Las <strong>tarjetas de d&eacute;bito</strong> son lo m&aacute;s parecido a pagar en efectivo. Cuando pagamos, estamos pagando con nuestro dinero. En algunas se nos permite caer en n&uacute;meros rojos (VISA Debit) mientras que en otros se comprueba la existencia de fondos (VISA Electron). Inmediatamente a la compra, el dinero se descuenta de la cuenta bancaria asociada. Estas tarjetas suelen tener gastos de mantenimiento menores (en Espa&ntilde;a los bancos las suelen dar gratis) y son pr&aacute;cticamente igual de admitidas que las de cr&eacute;ditos en cajeros autom&aacute;ticos, establecimientos y compras por Internet. No obstante, las tarjeta de d&eacute;bito no son aceptadas en todos los sitios, por dos motivos:<br /><br /></p>
<ul>
<ul>
<li>Las tarjetas de d&eacute;bito (como VISA Electron) requieren conexi&oacute;n a la cuenta bancaria de tu banco. Este proceso es m&aacute;s complicado que simplemente anotar que debes 50&euro; a fulanito. Otras tarjetas como VISA Debit pueden funcionar en puntos de pago offline ya que pueden dejarte en n&uacute;meros rojos (por tanto, el comerciante se asegura que siempre va a recibir el dinero, a&uacute;n sin saber cuanto dinero tienes).</li>
</ul>
</ul>
<p>&nbsp;</p>
<ul>
<ul>
<li>Las tarjetas de d&eacute;bito no dejan gastar m&aacute;s dinero del que hay en cuenta (o pueden dejar, pero no demasiado).</li>
</ul>
</ul>
<p><br /><br />Por estos dos motivos, puede ser que una tarjeta de d&eacute;bito no llegue a funcionar en alg&uacute;n pa&iacute;s extranjero (aunque es cada vez m&aacute;s raro) o simplemente no se admitan para poder as&iacute; cobrarte gastos imprevistos (alquileres de coches, hoteles, ...). Si bien en esto las tarjetas de d&eacute;bito han ido mejorando y en muchas existe la posibilidad de <em>reservar</em> una cantidad de dinero de la tarjeta. Eso quiere decir que al hacerel primer pago o la entrada, se nos cobra una parte y se nos reserva otra. Esa cantidad reservada a efectos pr&aacute;cticos no podemos usarla para nada pero t&eacute;cnicamente sigue siendo nuestro. Cuando se acaba el plazo y no ha hecho falta recurrir a ese dinero de reserva, el comerciante libera ese dinero y ya lo podemos usar en nuestra tarjeta.<br /><br />Las <strong>tarjetas prepago</strong> funcionan con tecnolog&iacute;a similar a las de d&eacute;bito, salvo por el detalle de que no tienen asociada una cuenta bancaria como tal. En vez de eso, las tarjetas prepago tienen una cuenta propia, que debemos recargar antes de efectuar pagos o retirar dinero. Las tarjetas prepago se han vuelto muy populares para menores de edad y compras por Internet, donde solo se recarga la tarjeta con la cantidad m&aacute;xima que consideremos necesario.<br /><br /><a href="https://files.adrianistan.eu/Antes.png"><img class="size-large wp-image-986" src="https://files.adrianistan.eu/Antes-1024x576.png" alt="" width="840" height="473" /></a> La tarjeta Antes de BBVA es una tarjeta prepago<br /><br />Por &uacute;ltimo, existe otro tipo de tarjeta, aunque apenas usadas en compras, se trata de las <strong>tarjetas monedero</strong>. Su diferencia principal respecto a las <strong>tarjetas prepago</strong> reside en como se realiza el pago. En una tarjeta prepago, se realiza una conexi&oacute;n al emisor de la tarjeta, como con las de d&eacute;bito, mientras que en una monedero no. En una tarjeta monedero el dinero se almacena en la propia tarjeta, de forma cifrada. Este sistema no es tan popular y en Espa&ntilde;a que yo sepa ning&uacute;n banco emite tarjetas de este tipo. Son usadas sin embargo en algunos sistemas de transporte p&uacute;blico o de empresas, donde se puede descontar el dinero instant&aacute;neamente, aunque no haya conexi&oacute;n con un servidor central. La forma de recargar estas tarjetas es acudir con la propia tarjeta a un punto de recarga, no pudiendo realizarse por Internet o sin la tarjeta.<br /><br /><a href="https://files.adrianistan.eu/BonobusCajaDuerp.jpg"><img class="size-full wp-image-964" src="https://files.adrianistan.eu/BonobusCajaDuerp.jpg" alt="" width="700" height="525" /></a> Tarjeta monedero emitida por Caja Duero para el transporte urbano de Valladolid<br /><br />Mencionar tambi&eacute;n las <strong>tarjetas ATM</strong>. Estas tarjetas &uacute;nicamente pueden usarse en los cajeros para sacar dinero, no pudi&eacute;ndose usar en las compras. De este modo funcionan similar a algunas <strong>libretas de ahorro</strong>. Sin embargo, he de reconocer que personalmente no he visto ninguna tarjeta ATM.</p>
<h2>Redes bancarias</h2>
<p><br />Si nos centramos en tarjetas de cr&eacute;dito, d&eacute;bito y prepago tenemos que tener en cuenta las redes interbancarias. Estas permiten las conexiones entre las redes de los distintos bancos y permiten por ejemplo que podamos sacar dinero en un cajero de <strong>Espa&ntilde;aDuero</strong> cuando nuestra tarjeta la ha emitido <strong>N26 Bank</strong> o que podamos pagar en el extranjero. En el sistema bancario, no existe nada parecido a Internet (la red de redes) y cada red tiene sus propios puntos de acceso. As&iacute; pues, no todos los cajeros tienen por qu&eacute; poder conectarse a todas las redes existentes, con los consiguientes problemas (no poder sacar dinero, no poder pagar,...). En tarjetas de d&eacute;bito esto es m&aacute;s problem&aacute;tico. En Espa&ntilde;a existen tres redes locales aunque funcionan tambi&eacute;n redes internacionales.<br /><br /></p>
<ul>
<ul>
<li>Servired, la mayor red intranacional de Espa&ntilde;a, con el BBVA, Bankinter, Deutsche Bank, Sabadell, Bankia, CaixaBank, Cajamar, las cajas rurales que est&aacute;n unidas por el Banco Cooperativo Espa&ntilde;ol, Triodos Bank, Self Bank, Banco Mediolanum, Caixa Geral, Laboral Kutxa, Abanca y otros bancos m&aacute;s peque&ntilde;os.</li>
</ul>
</ul>
<p>&nbsp;</p>
<ul>
<ul>
<li>4B, originalmente para Banco Santander, Banco Popular, Banco Pastor y Banesto, ahora tambi&eacute;n ING, Targobank, Openbank, Banca March, Cetelem, Inversis, Andbank y alguno m&aacute;s.</li>
</ul>
</ul>
<p>&nbsp;</p>
<ul>
<ul>
<li>Euro6000, usada antiguamente por las cajas de ahorros, hoy en d&iacute;a de sostiene gracias a Unicaja, Espa&ntilde;aDuero, Ibercaja, Kutxabank, Liberbank y EVO Banco.</li>
</ul>
</ul>
<p><br /><br /><a href="https://files.adrianistan.eu/Servired.jpg"><img class="size-full wp-image-965" src="https://files.adrianistan.eu/Servired.jpg" alt="" width="640" height="419" /></a> Cajero perteneciente a la red intranacional Servired. Tambi&eacute;n aparecen logos de PLUS, Cirrus, Tarjeta 6000, Eurocheque, Eurocard,...<br /><br /><a href="https://files.adrianistan.eu/Telebanco4B.jpg"><img class="size-large wp-image-966" src="https://files.adrianistan.eu/Telebanco4B-1024x768.jpg" alt="" width="840" height="630" /></a> Indicativo del Banco Pastor y Telebanco 4B<br /><br /><a href="https://files.adrianistan.eu/Euro6000IberCaja.jpg"><img class="size-full wp-image-967" src="https://files.adrianistan.eu/Euro6000IberCaja.jpg" alt="" width="674" height="392" /></a> IberCaja, con sede en Zaragoza, es una de las entidades que sigue dentro de Euro 6000<br /><br />Estas redes se comunican con otras redes similares de otros pa&iacute;ses o bien pueden recurrir a una red internacional, como <strong>Cirrus</strong>. Aunque despu&eacute;s de la crisis de 2008 muchos bancos y cajas se han fusionado entre s&iacute;, parece que las tres redes siguen operando de forma independiente.<br /><br /><a href="https://files.adrianistan.eu/Cirrus_2016.svg_.png"><img class="size-large wp-image-968" src="https://files.adrianistan.eu/Cirrus_2016.svg_-1024x796.png" alt="" width="840" height="653" /></a> Logo actual de la red interbancaria Cirrus</p>
<h2>Tarjetas</h2>
<p><br />Vamos ahora a ver las principales empresas que se dedican a las tarjetas:<br /><br /><strong>VISA</strong> (anteriormente Bank AmeriCard) es quiz&aacute; la tarjeta m&aacute;s conocida del mundo. Es la tarjeta l&iacute;der en Espa&ntilde;a. A nivel global es la segunda red m&aacute;s importante (solo superada por <strong>UnionPay</strong>). Las tarjetas VISA operan a trav&eacute;s de la red interbancaria <strong>PLUS</strong>. VISA dispone de varios tipos de tarjeta: VISA, VISA Debit, VISA Electron y V Pay. VISA es de cr&eacute;dito, <strong>VISA Debit</strong> es la versi&oacute;n m&aacute;s libre de las de d&eacute;bito. Permite dejarte en n&uacute;meros rojos ya que al hacer un pago no se comprueba la disponibilidad de fondos. Es por ello que la VISA Debit puede usarse en algunos sitios donde solo se admiten tarjetas de cr&eacute;dito por ese mismo motivo, el comerciante se puede asegurar que va a recibir su dinero aunque no sepa si tu cuenta tiene fondos. <strong>VISA Electron</strong> por contra, verifica que haya fondos suficientes en la cuenta, as&iacute; que necesita que exista una conexi&oacute;n con el banco. Desde hace no mucho existe <strong>V Pay</strong>, una tarjeta de d&eacute;bito mucho m&aacute;s moderna, emitidas solo con chip y que solo funcionan en <strong>SEPA</strong> (Single Euro Payments Area). Han sido dise&ntilde;adas para ser usadas en transacciones peque&ntilde;as y por lo general funcionan de forma similar a <strong>VISA Electron</strong>.<br /><br /><a href="https://files.adrianistan.eu/Visa_Electron.jpg"><img class="size-full wp-image-969" src="https://files.adrianistan.eu/Visa_Electron.jpg" alt="" width="729" height="456" /></a> Logo antiguo de VISA Electron<br /><br /><a href="https://files.adrianistan.eu/PLUS.png"><img class="size-large wp-image-970" src="https://files.adrianistan.eu/PLUS-1024x648.png" alt="" width="840" height="532" /></a> PLUS es la red interbancaria de VISA<br /><br /><a href="https://files.adrianistan.eu/VPay.png"><img class="size-large wp-image-971" src="https://files.adrianistan.eu/VPay-941x1024.png" alt="" width="840" height="914" /></a> V Pay es la gama m&aacute;s moderna de VISA, s&oacute;lo v&aacute;lida en territorios SEPA<br /><br /><strong>MasterCard</strong>, la gran competidora de VISA en Espa&ntilde;a. MasterCard entro en el mercado europeo con las adquisiciones de <strong>Eurocard</strong> y <strong>Europay</strong>. Su red interbancaria es <strong>Cirrus</strong>. Posee varias tarjetas: MasterCard, Debit MasterCard y Maestro. MasterCard es la l&iacute;nea de tarjetas de cr&eacute;dito, Debit MasterCard es una l&iacute;nea de tarjetas de d&eacute;bito compatibles con puntos offline y n&uacute;meros rojos (como VISA Debit) y Maestro es comparable a VISA Electron, ya que requiere comprobaci&oacute;n de fondos. No obstante, Maestro tambi&eacute;n puede funcionar como tarjeta prepago y las tarjetas Maestro son distintas al resto de tarjetas MasterCard y VISA. En ciertos pa&iacute;ses, Maestro funciona como Debit MasterCard, por lo que no requiere autorizaci&oacute;n electr&oacute;nica. Las tarjetas Maestro tambi&eacute;n son compartidas en algunos pa&iacute;ses con alg&uacute;n proveedor local de tarjetas, como <strong>Girocard</strong> en Alemania. Maestro fue de las primeras tarjetas donde no hab&iacute;a que firmar, sino que se introduc&iacute;a un PIN al comprar, tanto si se compra usando chip como con banda magn&eacute;tica. Muchas Maestro que no pueden usarse en el extranjero e Internet. En Espa&ntilde;a, las tarjetas Maestro nunca han llegado a ser populares.<br /><br /><a href="https://files.adrianistan.eu/MasterCard-Cirrus-and-Maestro.jpg"><img class="size-full wp-image-972" src="https://files.adrianistan.eu/MasterCard-Cirrus-and-Maestro.jpg" alt="" width="640" height="113" /></a> Logos antiguos de MasterCard, Cirrus y Maestro<br /><br /><strong>American Express</strong> es la tercera entidad de tarjetas en Espa&ntilde;a. Sin embargo, debido a sus altas comisiones, es f&aacute;cil encontrar tiendas que no la admitan.<br /><br /><a href="https://files.adrianistan.eu/AmericanExpress.png"><img class="aligncenter size-large wp-image-973" src="https://files.adrianistan.eu/AmericanExpress-1024x1024.png" alt="" width="840" height="840" /></a><br /><br /><strong>Discover</strong> y <strong>Diners Club</strong> son bastante usadas en Estados Unidos y otros pa&iacute;ses como Croacia. En Espa&ntilde;a son bastante dif&iacute;ciles de encontrar y se suelen aceptar &uacute;nicamente en establecimientos tur&iacute;sticos. Hasta hace a&ntilde;os eran empresas con tarjetas independientes, no obstante, <strong>Discover</strong> adquiri&oacute; Diners Club hace a&ntilde;os. Discover se centrar&aacute; en el mercado dom&eacute;stico estadounidense y Diners Club, que era m&aacute;s usada internacionalmente, seguir&aacute; con la expansi&oacute;n internacional.<br /><br /><a href="https://files.adrianistan.eu/Discover.jpg"><img class="aligncenter size-full wp-image-974" src="https://files.adrianistan.eu/Discover.jpg" alt="" width="1000" height="750" /></a><br /><br /><strong>JCB</strong>, se trata de una entidad japonesa de tarjetas. Es usada sobretodo por japoneses y coreanos.<br /><br /><a href="https://files.adrianistan.eu/JCB_logo.svg_.png"><img class="aligncenter size-full wp-image-975" src="https://files.adrianistan.eu/JCB_logo.svg_.png" alt="" width="200" height="155" /></a><br /><br /><strong>UnionPay</strong>, es la compa&ntilde;&iacute;a de tarjetas m&aacute;s grande del mundo, aunque la mayor parte de sus transacciones se concentran en China. Solo las emiten bancos chinos.<br /><br /><a href="https://files.adrianistan.eu/UnionPay_logo.svg_.png"><img class="size-large wp-image-976" src="https://files.adrianistan.eu/UnionPay_logo.svg_-1024x657.png" alt="" width="840" height="539" /></a> UnionPay es la tarjeta m&aacute;s usada del mundo desde 2015<br /><br /><strong>RuPay</strong>, son unas tarjetas de amplio uso creadas con intervenci&oacute;n del gobierno de la India con el deseo de que todos los habitantes de la India pudieran disponer de esta forma de pago.<br /><br /><a href="https://files.adrianistan.eu/1200px-RuPay.svg_.png"><img class="aligncenter size-large wp-image-977" src="https://files.adrianistan.eu/1200px-RuPay.svg_-1024x724.png" alt="" width="840" height="594" /></a><br /><br />Otras tarjetas pueden ser <strong>Bancomat</strong> (Italia),&nbsp;<strong>Elo</strong> (Brasil) o <strong>Dankort</strong> (Dinamarca). Este tipo de tarjetas, debido a su poca popularidad suelen ser compatibles con VISA y MasterCard en el extranjero, mientras que en sus pa&iacute;ses de origen usan su red interna.<br /><br /><a href="https://files.adrianistan.eu/Elofundo.png"><img class="size-full wp-image-978" src="https://files.adrianistan.eu/Elofundo.png" alt="" width="518" height="207" /></a> Elo es muy usada dentro de Brasil</p>
<h2>&iquest;C&oacute;mo funcionan las tarjetas?</h2>
<p><br />Ahora vamos a ver como se puede pagar con las tarjetas de cr&eacute;dito, d&eacute;bito y prepago. En primer lugar comentemos algo sobre el n&uacute;mero de las tarjetas. Estas tienen normalmente 16 d&iacute;gitos, aunque pueden llegar a 19 d&iacute;gitos. Se numeran por lotes, siendo los primeros d&iacute;gitos los correspondientes a la empresa. Es posible reconocer la empresa detr&aacute;s de la tarjeta seg&uacute;n su n&uacute;mero o <strong>PAN</strong>.<br /><br />Los <strong>PAN</strong> siguen una estructura, que aunque presenta longitud variable, est&aacute; bien definida.<br /><br /><a href="https://files.adrianistan.eu/UnoE.png"><img class="aligncenter size-large wp-image-979" src="https://files.adrianistan.eu/UnoE-1024x576.png" alt="" width="840" height="473" /></a><br /><br />El primer d&iacute;gito corresponde al <strong>Major Industry Identifier (MII)</strong>. Indica a que sector pertenece la empresa de la que es la tarjeta. Los sectores son:</p>
<table>
<tbody>
<tr>
<th>D&iacute;gito</th>
<th>Sector</th>
</tr>
<tr>
<td>0</td>
<td>Uso interno</td>
</tr>
<tr>
<td>1</td>
<td>Aerol&iacute;neas</td>
</tr>
<tr>
<td>2</td>
<td>Aerol&iacute;neas y otros</td>
</tr>
<tr>
<td>3</td>
<td>Viajes, entretenimiento, finanzas</td>
</tr>
<tr>
<td>4</td>
<td>Finanzas</td>
</tr>
<tr>
<td>5</td>
<td>Finanzas</td>
</tr>
<tr>
<td>6</td>
<td>Finanzas</td>
</tr>
<tr>
<td>7</td>
<td>Petroleras</td>
</tr>
<tr>
<td>8</td>
<td>Salud y telecomunicaciones</td>
</tr>
<tr>
<td>9</td>
<td>Sin asignar</td>
</tr>
</tbody>
</table>
<p><br />Aunque actualmente, la mayor&iacute;a de tarjetas son de finanzas. El <strong>MII</strong> y los siguientes 5 d&iacute;gitos forman el <strong>BIN</strong> o <strong>Bank Identification Number</strong> y sirven para idenficar al banco emisor de la tarjeta y enrutarlo. Los siguientes d&iacute;gitos excepto el &uacute;ltimo forman parte del identificador de tarjeta personal, asignado por el banco a sus clientes. El &uacute;ltimo d&iacute;gito es de comprobaci&oacute;n y se calcula con el algoritmo de Luhn.</p>
<table>
<tbody>
<tr>
<th>N&uacute;mero(s) de inicio</th>
<th>Longitud n&uacute;mero de tarjeta</th>
<th>Empresa</th>
</tr>
<tr>
<td>22 a 27</td>
<td>16</td>
<td>MasterCard</td>
</tr>
<tr>
<td>30</td>
<td>14</td>
<td>Diners Club</td>
</tr>
<tr>
<td>34</td>
<td>15</td>
<td>American Express</td>
</tr>
<tr>
<td>35</td>
<td>16</td>
<td>JCB</td>
</tr>
<tr>
<td>36</td>
<td>14</td>
<td>Diners Club</td>
</tr>
<tr>
<td>37</td>
<td>15</td>
<td>American Express</td>
</tr>
<tr>
<td>38, 39</td>
<td>14</td>
<td>Diners Club</td>
</tr>
<tr>
<td>4</td>
<td>16</td>
<td>VISA</td>
</tr>
<tr>
<td>5018, 502, 503, 506</td>
<td>12 a 16</td>
<td>Maestro</td>
</tr>
<tr>
<td>5019</td>
<td>16</td>
<td>Dankort</td>
</tr>
<tr>
<td>51 a 55</td>
<td>16</td>
<td>MasterCard</td>
</tr>
<tr>
<td>56 a 58</td>
<td>12 a 19</td>
<td>Maestro</td>
</tr>
<tr>
<td>60</td>
<td>16</td>
<td>Discover</td>
</tr>
<tr>
<td>62</td>
<td>16 a 19</td>
<td>UnionPay</td>
</tr>
<tr>
<td>622, 64, 65</td>
<td>16</td>
<td>Discover</td>
</tr>
<tr>
<td>639, 6220</td>
<td>12 a 19</td>
<td>Maestro</td>
</tr>
<tr>
<td>88</td>
<td>16 a 19</td>
<td>UnionPay</td>
</tr>
</tbody>
</table>
<p><br />Esta tabla no es exhaustiva pero puede servir de referencia r&aacute;pida. Por ejemplo, aunque VISA empieza siempre por 4, no todas las que empiezan por 4 son VISA siempre, ya que existen tarjetas <strong>Elo</strong> que tambi&eacute;n empiezan por 4. No obstante, se trata de rangos tan peque&ntilde;os que la lista ser&iacute;a muy larga si fuese exhaustiva.</p>
<h3>Banda magn&eacute;tica y firma</h3>
<p><br />Estas tarjetas, mejorando las de cart&oacute;n, agilizan el proceso de pago pero ni introducen ninguna medida de seguridad extra. Se definen seg&uacute;n el est&aacute;ndar ISO/IEC 7813 e ISO/IEC 7811. Incluyen una banda magn&eacute;tica desde la que se puede leer el n&uacute;mero de la tarjeta, la fecha de caducidad, los nombres del titular y algunos datos t&eacute;cnicos. Las tarjetas tienen 3 bandas o <em>tracks</em>.<br /><br /><a href="https://files.adrianistan.eu/Tracks.gif"><img class="size-full wp-image-983" src="https://files.adrianistan.eu/Tracks.gif" alt="" width="686" height="135" /></a> Los 3 tracks de las bandas magn&eacute;ticas y su posici&oacute;n<br /><br />El primer y segundo track llevan informaci&oacute;n redudante, de forma que si una banda est&aacute; da&ntilde;ada puede leerse la otra, sin embargo no siguen el mismo formato.</p>
<table>
<tbody>
<tr>
<th>Nombre del campo</th>
<th>Longitud</th>
<th>Uso</th>
</tr>
<tr>
<td>Start Sentinel (SS)</td>
<td>1 caracter</td>
<td>Indica que comienza el track 1, siempre es %</td>
</tr>
<tr>
<td>Format Code (FC)</td>
<td>1 caracter</td>
<td>Indica el tipo de tarjeta, B para cr&eacute;dito/d&eacute;bito</td>
</tr>
<tr>
<td>Primary Account Number (PAN)</td>
<td>Hasta 19 digitos</td>
<td>Normalmente, el n&uacute;mero de la tarjeta que est&aacute; impreso</td>
</tr>
<tr>
<td>Field Separato