<p>La web sem&aacute;ntica ha sido un concepto estudiado y desarrollado por W3C pr&aacute;cticamente desde el comienzo de la web misma por el propio Tim Berners-Lee, aunque su desarrollo se aceler&oacute; con el art&iacute;culo de 2001 en Scientific American, <em>The Semantic Web</em>. La idea es muy sencilla, si la web ha servido para enlazar documentos, de distintos or&iacute;genes, la web sem&aacute;ntica es lo mismo, pero reduci&eacute;ndonos a lo m&aacute;s fundamental, los datos en s&iacute; y adem&aacute;s, de forma comprensible para ser procesado por una m&aacute;quina.<br /><br />El concepto es muy prometedor, pero con el paso de los a&ntilde;os cada vez se oye menos sobre el tema. En este art&iacute;culo analizaremos las tecnolog&iacute;as que componen la web sem&aacute;ntica y los problemas que tiene en el mundo actual.</p>
<h2><br />Demasiados est&aacute;ndares</h2>
<p>La web sem&aacute;ntica dispone de varios est&aacute;ndares con la misma finalidad, o con objetivos superpuestos. Esto es una redundancia que impide a los desarrolladores saber exactamente a qu&eacute; adherirse. Por ejemplo, es habitual pensar que RDF es un tipo de XML. Pero esto es incorrecto. RDF es un est&aacute;ndar abstracto que no especifica como se debe almacenar su informaci&oacute;n. Aparte de XML existen muchas otras implementaciones, v&aacute;lidas, para representar datos RDF: Turtle, N3, N-Quads, RDFa, JSON-LD,...<br /><br />No solo RDF sufre este problema. En los lenguajes de representaci&oacute;n de reglas de inferencia tambi&eacute;n ocurre. Existe de hecho un est&aacute;ndar dise&ntilde;ado para la interoperabilidad entre estos lenguajes, RIF: <em>Although originally envisioned by many as a "rules layer" for the semantic web, in reality </em><em>the design of RIF is based on the observation that there are many "rules languages" in existence, and </em><em>what is needed is to exchange rules between them.</em>. Mientras tanto W3C mantiene otro est&aacute;ndar para las reglas, SWRL (Semantic Web Rule Language). Existen adem&aacute;s otros est&aacute;ndares inpendientes: R2ML y RuleML.<br /><br />Estos est&aacute;ndares disponen muchas veces de varios perfiles o dialectos, dise&ntilde;ados para cargas de trabajo diferentes. RIF por ejemplo, tiene varios dialectos, algunos estandarizados (DTB, Core, FLD, BLD y PRD) y otros sin estandarizar (CASPD, URD y SILK principalmente).</p>
<p>&nbsp;</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://blog.adrianistan.eu/static/img/standards.png" alt="" width="500" height="283" /><br /><br />Esta fragmentaci&oacute;n tambi&eacute;n se ha visto en el propio formato RDF. Al ser demasiado abstracto, algunos programadores dise&ntilde;aron de forma m&aacute;s pragm&aacute;tica los formatos microformats y microdata, que aunque pueden ser sustituidos por RDFa, estos primeros son m&aacute;s sencillos de comprender. Estos est&aacute;ndares tienen unas ontolog&iacute;as fijas, &uacute;tiles, adaptadas y sin posibilidad de ser extendidas o reemplazadas (aunque microformats2 si es m&aacute;s potente es este aspecto). La idea es <em>evolucionar la web</em> en vez <br />de <em>revolucionar la web</em>, proponiendo cambios que causen poca fricci&oacute;n en el desarrollo web actual. Esto forma parte del movimiento de la web sem&aacute;ntica en letras min&uacute;sculas.</p>
<h2><br />Demasiada abstracci&oacute;n y falta de formaci&oacute;n</h2>
<p>Muchos est&aacute;ndares de la W3C se definen de forma muy abstracta, priorizando la correcci&oacute;n de los est&aacute;ndares desde un punto de vista te&oacute;rico. Los desarrolladores no est&aacute;n acostumbrados a tales niveles de abstracci&oacute;n y esperan tecnolog&iacute;a mucho m&aacute;s concreta.<br /><br />Si a esto se le suman pocos ejemplos de uso pr&aacute;ctico, poca documentaci&oacute;n de entrada y una falta de marketing respecto a otras tecnolog&iacute;as, muy poca gente va a poder entender el modelo mental de RDF y sacar toda su potencia.</p>
<h2><br />Burocracia</h2>
<p>Algunas partes de la web sem&aacute;ntica sufren de un problema burocr&aacute;tico. No solo los est&aacute;ndares llegan tarde y sin implementaci&oacute;n de referencia, sino que muchas veces el proceso de realizar modificaciones o a&ntilde;adir un elemento es lento y laborioso.<br /><br />El proceso de comit&eacute; de W3C ha demostrado ser lento e ineficaz en otras &aacute;reas. Por ejemplo, los navegadores han dejado de seguir el est&aacute;ndar HTML de W3C para centrarse en el est&aacute;ndar HTML de WHATWG, una organizaci&oacute;n creada por ellos mismos, mucho m&aacute;s r&aacute;pida en definir nuevas caracter&iacute;sticas. Gracias a WHATWG se pudo lograr HTML5, que luego fue estandarizado por W3C cuando todos los navegadores ya hab&iacute;an implementado las caracter&iacute;sticas del est&aacute;ndar. Otro caso similar existe con SVG, el est&aacute;ndar de gr&aacute;ficos vectoriales, que ha sido criticado por nunca lanzar la revisi&oacute;n SVG 2.0, debido a problemas internos.<br /><br />Otros componentes de la web sem&aacute;ntica como las URI ni siquiera son asignadas por la W3C sino que la asignaci&oacute;n de esquemas depende de IANA.</p>
<h2><br />Protecci&oacute;n de datos</h2>
<p>A nivel legal, muchos empresas y organizaciones prefieren mantener los datos de car&aacute;cter personal de forma privada. No existe un sistema integrado que permita acceder solamente a ciertos agentes acceder a determinada informaci&oacute;n de una base de datos. La web sem&aacute;ntica parece preparada &uacute;nicamente para datos de car&aacute;cter totalmente abierto, no parcialmente abiertos.</p>
<h2>Valor de los datos</h2>
<p>Seg&uacute;n diversos analistas los datos se han convertido en el nuevo petr&oacute;leo. Una empresa vale m&aacute;s por los datos que tiene que por los servicios que presta. Si asumimos esto, &iquest;por qu&eacute; regalar los datos? Ser&iacute;a tan tonto como regalar dinero. Las empresas han aprendido a mantener los datos de forma cerrada, para consumo propio o previo pago de grandes cantidades de dinero. <br /><br />Existen empresas, no obstante, que facilitan APIs para acceder y manipular la informaci&oacute;n. La gracia de estos sistemas es que est&aacute;n limitados en cuanto a peticiones y a la informaci&oacute;n a la que podemos acceder. Estas APIs, aunque suelen seguir un modelo REST com&uacute;n, no son interoperables entre s&iacute;. De este modo se intenta mantener la filosof&iacute;a del jard&iacute;n cerrado. Que los desarrolladores puedan hacer software que complemente a mi plataforma y no al rev&eacute;s.<br /><br />A grandes empresas como Google o Facebook no les interesa que toda su informaci&oacute;n sea accesible por otros desarrolladores, ya que les restar&iacute;a valor a su empresa. Es evidente que estas empresas no van a invertir en estas tecnolog&iacute;as, al menos para su desarrollo p&uacute;blico. En el caso de Google est&aacute; actitud es muy evidente. En 2010 compr&oacute; <a href="https://en.wikipedia.org/wiki/Freebase">Freebase</a>, una base de datos sem&aacute;ntica abierta bastante importante, para despu&eacute;s cerrarla e integrar su tecnolog&iacute;a en Google Knowledge Graph.<br /><br />S&oacute;lamente organizaciones como Wikipedia, MusicBrainz, DBpedia y los distintos organismos p&uacute;blicos mantienen bases de datos accesibles de forma totalmente abierta y transparente de los datos. Muchas de estas acciones englobadas dentro del movimiento Open Data pero la adopci&oacute;n por parte de las empresas ha ido decreciendo.</p>
<h2><br />Escalabilidad</h2>
<p>Se ha criticado que los modelos basados en RDF no son escalables. En efecto la mayor&iacute;a de implementaciones no han sido tan trabajadas como lo han podido ser bases de datos relacionales, o software de procesamiento Big Data. Es cierto que servidores como Virtuoso son capaces de manejar miles de millones de tripletas, pero sigue habiendo problemas subyacentes relacionado con la dificultad del indexado de RDF.</p>
<h2><br />Laboriosidad</h2>
<p>Formalizar el conocimiento lleva un esfuerzo considerable. Lleva esfuerzo tanto en la parte de creaci&oacute;n de los esquemas como en la parte de generaci&oacute;n de los datos. Con la aparici&oacute;n de sistemas Big Data, la tendencia es a almacenar los datos tal y como es generada, para luego ser analizada. Aunque se podr&iacute;an usar estos sistemas, para intentar formalizar los datos, no parece ser una pr&aacute;ctica com&uacute;n. Existen pocas herramientas enfocadas a hacer menos laborioso el trabajo, con la &uacute;nica excepci&oacute;n de Prot&eacute;g&eacute; para la elaboraci&oacute;n de ontolog&iacute;as.<br /><br />Han surgido ontolog&iacute;as m&aacute;s simples, con enfoque pr&aacute;ctico en organizaciones como <a href="http://schema.org">Schema.org</a>, donde los buscadores (Google, Bing, Yandex, ...) definen ontolog&iacute;as v&aacute;lidas para RDFa, con el fin de dotar a sus buscadores de mayor poder sem&aacute;ntico. Otros ejemplos son la iniciativa <a href="http://dublincore.org/">Dublin Core</a>.</p>
<h2><br />Falta de implementaciones</h2>
<p>La web sem&aacute;ntica dispone de muchas programas, de tipo acad&eacute;mico, muchos de ellos abandonados al poco tiempo. No obstante no hay apenas sistemas listos para producci&oacute;n. Muchos sistemas de gesti&oacute;n de bases de datos con soporte a tecnolog&iacute;as de la web sem&aacute;ntica no lo hacen de forma exclusiva. Existen varias bases de datos con soporte a SPARQL, <a href="https://virtuoso.openlinksw.com/">Virtuoso</a>, <a href="https://www.marklogic.com/">MarkLogic</a>, <a href="https://jena.apache.org/">Apache Jena</a>, <a href="https://aws.amazon.com/es/neptune/">Amazon Neptune</a>, Neo4j, aunque no en todos estos sistemas SPARQL es la opci&oacute;n recomendada por sus autores. Algunos est&aacute;ndares no est&aacute;n implementados (OWL2 solo es implementado por MarkLogic de forma completa).<br /><br />Fuera de las bases de datos existen todav&iacute;a menos librer&iacute;as que manejen RDF de forma sencilla para el programador, siendo el &uacute;nico ejemplo destacable la librer&iacute;a <a href="https://github.com/RDFLib/rdflib">RDFLib</a> para Python, que incluye un int&eacute;rprete de SPARQL para consultas locales, as&iacute; como un adaptador para usar PostgreSQL como almac&eacute;n de tuplas RDF.<br /><br />W3C no se ha encargado de mantener implementaciones de referencia de sus est&aacute;ndares.</p>
<h2><br />Conclusiones</h2>
<p>Creo firmemente que estamos ante una situaci&oacute;n de <em>worse is better</em>. Concepto ingenieril donde los haya que viene a decir se <br />resume en estas m&aacute;ximas:</p>
<ul>
<li>El dise&ntilde;o debe ser simple, tanto en implementaci&oacute;n como en interfaz. La simplicidad es el elemento m&aacute;s importante del dise&ntilde;o</li>
<li>El dise&ntilde;o no debe ser inconsistente. La consistencia puede ser sacrificada por la simplicidad, o pueden eliminarse del dise&ntilde;o las partes menos comunes o que introducen complejidad innecesaria</li>
<li>El dise&ntilde;o cubrir todas las situaciones cu&aacute;l probables sea que ocurran. Todos los casos razonablemente probables deben ser cubiertos. En todo caso, la completitud es la &uacute;ltima propiedad a tener en cuenta.</li>
</ul>
<p>Este estilo, denominado <em>escuela de Nueva Jersey</em> tiene su m&aacute;ximo exponente en UNIX y C, piezas tecnol&oacute;gicas de gran &eacute;xito cuya fama se basa en el uso de estas reglas. Un enfoque ingenieril basado en compromisos. Todo en contraposici&oacute;n a la <em>escuela de MIT</em>, de origen acad&eacute;mico, identificado popularmente con Lisp. El enfoque acad&eacute;mico no admite incorreciones, inconsistencias y completitud. La simplicidad es deseable, pero sin sacrificar en ning&uacute;n momento las caracter&iacute;sticas anteriores.<br /><br />Las tecnolog&iacute;as de la web sem&aacute;ntica parecen cumplir el enfoque de la escuela del MIT. Un producto acad&eacute;mico, que engloba a todo, a costa de reducir simplicidad.<br /><br />Afortunadamente muchos de los problemas mencionados aqu&iacute; est&aacute;n siendo tratados actualmente en una lluvia de ideas, denominada <a href="https://github.com/w3c/EasierRDF/"><strong>EasierRDF</strong></a> y W3C tiene intenci&oacute;n de ser m&aacute;s din&aacute;mica, sobre todo despu&eacute;s de haber perdido el control estandarizador de HTML y otras tecnolog&iacute;as clave, en favor de organizaciones m&aacute;s din&aacute;micas.<br /><br />Adem&aacute;s, se est&aacute;n desarrollando nuevos est&aacute;ndares de gran inter&eacute;s, como <a href="http://ipld.io">IPLD</a> (InterPlanetaryLinkedData) que permite extender la web sem&aacute;ntica a IPFS, Git y plataformas basadas en blockchain como Ethereum y Bitcoin.</p>