<p>Como muchos ya sab&eacute;is, pod&eacute;is contactar conmigo de muchas formas. De entre ellas,&nbsp;<em>Lector an&oacute;nimo<strong>&nbsp;</strong></em>eligi&oacute; el correo para enviarme esta pregunta:</p>
<blockquote>
<p><em>Hola.</em><br /><br /><em> Sigo tu blog desde hace alg&uacute;n tiempo y tienes un contenido interesante. </em><br /><em> Soy aficionado a la programaci&oacute;n y s&eacute; algo de Python. Estaba pensando en </em><br /><em> aprender Rust. El caso es que le&iacute; un art&iacute;culo y me gustar&iacute;a saber tu </em><br /><em> opini&oacute;n, o sugerencia para que escribas algo en tu blog.</em><br /><br /><em> <a href="https://drewdevault.com/2019/03/25/Rust-is-not-a-good-C-replacement.html" target="_blank" rel="noopener noreferrer" data-saferedirecturl="https://www.google.com/url?q=https://drewdevault.com/2019/03/25/Rust-is-not-a-good-C-replacement.html&amp;source=gmail&amp;ust=1566054755660000&amp;usg=AFQjCNEVLn7YxLcy3i89zFNRw7j7oDj0Nw">https://drewdevault.com/2019/0<wbr />3/25/Rust-is-not-a-good-C-repl<wbr />acement.html</a></em><br /><br /><em> Saludos.Lector an&oacute;nimo.</em></p>
</blockquote>
<p>Le respond&iacute; por correo pero os copio mi mensaje por si a alguno m&aacute;s le interesa:</p>
<blockquote>
<div><em>Hola Lector an&oacute;nimo,</em></div>
<div>&nbsp;</div>
<div><em>Muchas gracias por seguir el blog, aunque no lo creas, me anima mucho conocer gente nueva que lo haga. </em></div>
<div>&nbsp;</div>
<div><em>Respecto al art&iacute;culo, me sonaba de haberlo le&iacute;do antes (es de marzo as&iacute; que es posible). No estoy de acuerdo en la mayor&iacute;a de puntos aunque quiz&aacute; el que m&aacute;s me moleste es el que no hay una especificaci&oacute;n porque es una verdad a medias: no existe un est&aacute;ndar externo tipo ISO, ANSI o ECMA pero todos los cambios se someten a un proceso de RFC (<a href="https://github.com/rust-lang/rfcs/tree/master/text" target="_blank" rel="noopener" data-saferedirecturl="https://www.google.com/url?q=https://github.com/rust-lang/rfcs/tree/master/text&amp;source=gmail&amp;ust=1566071987532000&amp;usg=AFQjCNEwpXBAWNQutcXIuNVXtmG5ZzYW9A">https://github.com/rust-lang/<wbr />rfcs/tree/master/text</a>) que es el mismo que se usa en Internet y muy similar a las PEP de Python. Igualmente con lo de Cargo, por una vez que alguien hace algo decente en este campo con el tema de dependencias (que en C es un caos y realmente no se deber&iacute;a aspirar a eso).</em></div>
<div>&nbsp;</div>
<div><em>Por otro lado, el tono general del art&iacute;culo es que Rust es muy complejo y que C es m&aacute;s simple. Pero la cuesti&oacute;n de fondo, y que justifica en mi opini&oacute;n la complejidad de Rust (la cu&aacute;l no voy a negar) es que el problema que quiere resolver ES complejo y simplificarlo solo te puede llevar a dos opciones: no servir en todos los casos de uso o trasladar la complejidad a otro campo, que en el mundo de C, es la mente del programador que debe ser consciente de lo que hace. </em></div>
<div>&nbsp;</div>
<div><em>Lo mismo con el tema de la concurrencia, si es complejo de hacer en C como el admite es porque es dif&iacute;cil y porque cuando se dise&ntilde;&oacute; el lenguaje no era algo que se tuviese en cuenta (&iquest;cu&aacute;ntos multicores hab&iacute;a en los 70?), pero a diferencia de lo que &eacute;l dice, s&iacute; merece la pena muchas veces usar diferentes hilos, sobre todo ahora en que los procesadores no aumentan su velocidad (incluso disminuye, por eficiencia energ&eacute;tica) pero s&iacute; su n&uacute;mero de cores. </em></div>
<div>&nbsp;</div>
<div><em>Y luego finaliza con el tema de la seguridad que para &eacute;l no es importante, pero ES importante, sobre todo ahora que el software puede provocar:</em></div>
<ul>
<li><em>p&eacute;rdidas de vidas humanas (piensa en los aviones, los coches aut&oacute;nomos o las herramientas m&eacute;dicas avanzadas)</em></li>
<li><em>hackeos, robos de datos y otro tipo de ataques en pleno auge de los ciberataques</em></li>
</ul>
<div><em>En fin, yo he programado mucho en C y realmente me parece un buen lenguaje para su &eacute;poca, lo respeto mucho, pero creo que a d&iacute;a de hoy hemos avanzado algo y hemos encontrado cosas, que s&iacute;, pueden ser m&aacute;s complejas, pero resuelven de forma m&aacute;s correcta los problemas. Por eso si bien no soy partidario de iniciar proyectos nuevos en C, tampoco soy de esos que va pregonando que todo se reescriba en Rust jajaja.</em></div>
<div>&nbsp;</div>
<div><em>Respecto a si debes aprenderlo... Bueno, eso es algo personal, yo lo probar&iacute;a un poco y ver&iacute;a que tal. Laboralmente todav&iacute;a no tiene mucho tir&oacute;n (en mi trabajo por ejemplo no lo uso, aunque cada vez somos m&aacute;s los de la secta jejejeje) pero es muy interesante. Quiz&aacute; todav&iacute;a le falta algo de madurez pero con el tiempo llegar&aacute; (as&iacute; a lo tonto Python ya tiene 30 a&ntilde;os por ejemplo y Rust no llega a 10 todav&iacute;a).</em></div>
<div>&nbsp;</div>
<div><em>Si tienes alguna duda m&aacute;s, no te cortes y preg&uacute;ntame, ver&eacute; que puedo hacer jajaja</em></div>
<div>&nbsp;</div>
<div><em>Un saludo, Adri&aacute;n</em></div>
</blockquote>