<p>Bienvenidos a una nueva secci&oacute;n del a&ntilde;o 2020. Se trata de&nbsp;<strong>Teletexto</strong>, una secci&oacute;n donde recopilar&eacute; enlaces que considero interesantes junto con un peque&ntilde;o texto. La idea de esta secci&oacute;n viene de que tengo un Trello con ideas gigante. Muchas de ellas no las voy a tocar, pero me gustar&iacute;a mencionarlas en el blog, ya que me parecen cosas muy interesantes. As&iacute; pues, el contenido de esta secci&oacute;n ser&aacute; principalmente t&eacute;cnico, pero guiado por mi curiosidad y mi inter&eacute;s en las cosas que vaya viendo. Esta secci&oacute;n adem&aacute;s me servir&aacute; para poder publicar un poco m&aacute;s r&aacute;pido. Finalmente, se llama Teletexto, precisamente por ser una muy buena met&aacute;fora de lo que es: res&uacute;menes cortos de informaci&oacute;n y tecnolog&iacute;a algo ya viejuna, pero sumamente interesante. Y sin nada m&aacute;s que decir, empezamos la primera edici&oacute;n.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://files.adrianistan.eu/Teletexto.jpg" alt="" /></p>
<ul>
<li><strong><a href="https://impurepics.com/">Impure Pics</a></strong>, esta curiosa p&aacute;gina es un conjunto de memes e im&aacute;genes explicativas sobre el mundo de la programaci&oacute;n funcional, Haskell, Scala, PureScript,... &iexcl;Incluso tenemos un quiz para saber que tipo de typeclass somos! Muy recomendable su visita aunque no sepas de programaci&oacute;n funcional.</li>
</ul>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://files.adrianistan.eu/HaskellImpurePics.jpeg" alt="" width="500" /></p>
<ul>
<li>&iquest;Alguna vez has pensado cu&aacute;ntas cosas pueden ir dentro de la etiqueta HEAD en HTML? <a href="https://htmlhead.dev/">https://htmlhead.dev/</a> tiene un listado muy completo de qu&eacute; puede ir. Por supuesto, eso no quiere decir que tu p&aacute;gina deba llevar todas ellas, pero siempre est&aacute; bien darle un repaso.</li>
<li>Hace poco descubr&iacute; que existe un deporte llamado&nbsp;<a href="http://combatemedieval.org/"><em>Combate Medieval</em></a>. Al parecer, trata de recrear de forma l&uacute;dica y competitiva, el combate de la edad Media (pero sin morir claro). Hay incluso una liga nacional. Para m&aacute;s informaci&oacute;n, la web recoge las normas y principales clubs de Espa&ntilde;a.</li>
<li><strong>scikit-learn</strong>, sklearn para los amigos, es una de las mejores librer&iacute;as de Machine Learning que existen en la actualidad, sobre todo si quieres probar cosas diferentes a redes neuronales (que tambi&eacute;n tiene, pero ah&iacute; no es tan buena) o quieres realizar operaciones de limpieza de datos, test, etc. Recientemente, han sacado la versi&oacute;n 0.22 que incluye, entre otras cosas:
<ul>
<li>Una nueva API de plotteado</li>
<li>Los algoritmos de ensemble: StackingClassifier y StackingRegressor</li>
<li>Permutation Importance</li>
<li>Soporte para valores desconocidos en el Gradient Boosting</li>
<li>Poda de &aacute;rboles m&aacute;s completa</li>
<li>Mejoras en el m&oacute;dulo de OpenML</li>
<li>Y muchas m&aacute;s cosas</li>
<li>Lista de cambios de <a href="https://scikit-learn.org/stable/auto_examples/release_highlights/plot_release_highlights_0_22_0.html">sklearn 0.22</a></li>
</ul>
</li>
<li>Siguiendo con actualizaciones,&nbsp;<strong>Alpine Linux</strong>, una de las distros m&aacute;s importantes en el mundo cloud, ha lanzado la versi&oacute;n 3.11.0, abriendo la rama 3.11. Al poco publicaron la 3.11.2 por bugs iniciales, pero los cambios importantes son:
<ul>
<li>Linux 5.4</li>
<li>Soporte a Raspberry Pi 4</li>
<li>Soporte inicial a GNOME y KDE</li>
<li>Soporte a Vulkan</li>
<li>MinGW-w64 y Rust disponibles</li>
<li>Actualizaci&oacute;n gen&eacute;rica de paquetes</li>
<li>Python 2 est&aacute; obsoleto. Se han borrado la mayor&iacute;a de paquetes relativos a Python 2 aunque algunos todav&iacute;a quedan en esta versi&oacute;n.</li>
<li>Lista de cambios de <a href="https://alpinelinux.org/posts/Alpine-3.11.0-released.html">Alpine Linux 3.11</a></li>
</ul>
</li>
<li>Otra actualizaci&oacute;n m&aacute;s, <a href="https://docs.djangoproject.com/en/3.0/releases/3.0/">Django 3.0</a>, ha salido con la principal novedad el soporte a <strong>ASGI</strong>, que es el equivalente a WSGI pero en entornos as&iacute;ncronos. Esto es un cambio interno principalmente.</li>
<li>UNIX empieza a contar su tiempo interno desde el 1 de enero de 1970, una convenci&oacute;n llamada UNIX Epoch, y que se usa en bastantes sitios. Pero en el sistema operativo <strong>OpenVMS</strong> no, se empieza a contar desde el 17 de noviembre de 1858. Los motivos son bastante interesantes y <a href="https://www.slac.stanford.edu/~rkj/crazytime.txt">se pueden leer aqu&iacute;</a>.</li>
<li>Bases de datos hay muchas, y de tipos diferentes (no solo de tablas relacionales va a vivir el mundo). En este sector hubo algo de movimiento con la&nbsp;<strong>web sem&aacute;ntica</strong>, y se dise&ntilde;aron bases de datos especiales para esto. Sin embargo, no acabaron de despegar y su uso es muy minoritario. <a href="https://terminusdb.com/"><strong>TerminusDB</strong></a> es una base de datos nueva, hecha en <a href="../../introduccion-a-prolog-tutorial-en-espanol">Prolog</a> y que intenta dar una vuelta a esto volviendo a abrazar RDF y todo lo que conlleva. Es uno de mis descubrimientos personales del a&ntilde;o pasado y les deseo lo mejor. En mi opini&oacute;n creo que el enfoque que adopta no es el mejor, aunque es pr&aacute;ctico. Por un lado los documentos (siempre en JSON-LD) se gestionan con una sencilla API REST y por otro lado las consultas se realizan con WOQL en vez de <a href="../../web-semantica-sparql">SPARQL</a>.</li>
<li>Por &uacute;ltimo, acabamos con un enlace de sumo inter&eacute;s para aquellos que usen o vayan a usar <strong>PostgreSQL</strong>, y tambi&eacute;n recomendable a cualquier persona que toque SQL: <a href="https://postgres-bits.herokuapp.com">Postgres Bits</a>. Se trata de las diapositivas de una conferencia de Heroku sobre Postgres y nos cuenta 12 cosas que tiene Postgres que quiz&aacute; no conozcamos. Empezamos por los WITH y los ARRAYs y acabando con UUIDs y HSTORE (el almacenamiento clave-valor de Postgres).</li>
</ul>
<p>Para despedirnos del primer Teletexto vamos a poner una canci&oacute;n y tambi&eacute;n os pido que si hab&eacute;is encontrado algo interesante, lo pong&aacute;is en los comentarios, y as&iacute; el Teletexto ser&aacute; m&aacute;s interesante para todos.</p>
<p style="text-align: center;"><iframe src="https://www.youtube-nocookie.com/embed/C_WVQOAgll8" width="560" height="315" frameborder="0" allowfullscreen=""></iframe></p>