<p>Bienaventurados todos aquellos lectores del&nbsp;<em>Teletexto</em>. En esta segunda edici&oacute;n voy a seguir repasando algunos proyectos, art&iacute;culos y noticias que me parecen de inter&eacute;s.</p>
<p>&nbsp;</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://files.adrianistan.eu/TeletextoUcrania.png" alt="" /></p>
<ul>
<li>Esta semana ha sido triste para el mundo Rust. La librer&iacute;a actix-web, una de las m&aacute;s usadas para construir aplicaciones web fue declarada muerta y retirada de forma repentina por su creador, cansado de cientos de cr&iacute;ticas hacia su librer&iacute;a que constru&iacute;a en sus ratos libres. Reflexiona sobre ello Steve Klabnik en <a href="https://words.steveklabnik.com/a-sad-day-for-rust">A sad day for Rust</a>.</li>
<li>&iquest;No sabes que es DevOps? &iquest;Quieres informarte un poco sobre el tema? En el <a href="https://www.ivoox.com/undefined-v8-devops-audios-mp3_rf_46590275_1.html">podcast n&uacute;mero 8 de Undefined</a> hablamos de DevOps (s&iacute;, yo incluido)</li>
<li>Las falacias son las trampas en el mundo de la l&oacute;gica. Parecen argumentos convincentes pero no lo son. En <a href="https://falacias.escepticos.es/">https://falacias.escepticos.es/</a> tienen un listado muy completo de estas falacias, explicadas de forma gr&aacute;fica, con ejemplos y como rebatirlas.</li>
</ul>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://files.adrianistan.eu/Falacias.gif" alt="" /></p>
<ul>
<li>&iquest;Son los SMS de confirmaci&oacute;n seguros? Aunque muchas webs (en especial bancos) hayan pasado a usar estos servicios para conseguir un 2FA, hay muchos motivos para pensar que no son seguros. En <a href="https://www.issms2fasecure.com/">https://www.issms2fasecure.com/</a> exponen los resultados de una investigaci&oacute;n que confirm&oacute; que los SMS apenas supon&iacute;an un problema para acceder a los sistemas.</li>
<li>&iquest;Os acord&aacute;is del <a href="../../agromapa-castilla-leon">Agromapa de Castilla y Le&oacute;n</a>? Pues hace ya un tiempo, datos.gob.es, el portal nacional, incluy&oacute; esta aplicaci&oacute;n en su cat&aacute;logo: <a href="https://datos.gob.es/es/aplicaciones/agromapa-de-castilla-y-leon">https://datos.gob.es/es/aplicaciones/agromapa-de-castilla-y-leon</a></li>
<li>&iquest;Deber&iacute;an llevar los blogs un apartado para comentarios? Aunque parece una caracter&iacute;stica imprescindible, hay gente que piensa que no, que los blogs son estrictamente personales y si alguien quiere responderte, pueden hacerlo tambi&eacute;n en su propio blog. <a href="https://chrisdone.com/posts/blog-comments/">Reflexi&oacute;n de Chris Done</a>. Estad tranquilos, aunque me ha hecho meditarlo, en este blog se quedar&aacute;n los comentarios.</li>
<li>Hubo un tiempo en el que el mundo open source no sab&iacute;a que sistema de control de versiones usar. Lleg&oacute; a haber tres alternativas muy decentes para intentar sustituir a <a href="https://subversion.apache.org/">Subversion</a>: <a href="https://www.mercurial-scm.org/">Mercurial</a>, <a href="https://git-scm.com/">Git</a> y <a href="http://bazaar.canonical.com/en/">Bazaar</a>. Finalmente Git&nbsp;<em>ha ganado</em> aunque Mercurial sigue vivo en sitios como Facebook o Mozilla. Bazaar fue un proyecto de Canonical, usado principalmente en entornos cercanos a Ubuntu, y desde 2016 no ha tenido ninguna nueva versi&oacute;n. Finalmente ha habido un fork, llamado <a href="https://www.breezy-vcs.org/">Breezy</a>, que combina lo mejor de Bazaar con el soporte a Git de forma transparente. Es adem&aacute;s la &uacute;nica forma de gestionar repositorios Bazaar con Python 3.</li>
<li>&iquest;C&oacute;mo salir de VIM? <a href="https://github.com/hakluke/how-to-exit-vim/blob/master/README.md">Solo respuestas incorrectas</a>.</li>
<li><a href="https://www.csc.gov.sg/articles/how-to-build-good-software">&iquest;C&oacute;mo construir buen software?</a> Un art&iacute;culo muy interesante sobre los errores que llevan al software a fracasar. Adoptar la mentalidad que propone sobre el software puede ser muy &uacute;til, que por otro lado, parece de perogrullo.</li>
<li>Ryan C Gordon es un desarrollador conocido entre otras cosas, por mantener la librer&iacute;a SDL y haber portado gran cantidad de juegos a Linux. Recibi&oacute; dinero de Google, pero no quiso aceptarlo ppr la pol&iacute;tica de esta empresa ante los sindicatos. Decidi&oacute; repartir su dinero (y el de gente que quisiera colaborar) en ayudar a proyectos peque&ntilde;os. Lo ha llamado <a href="https://icculus.org/microgrant2019/">Icculus Microgrant 2019</a>. Hay proyectos muy interesantes, aunque uno era muy conocido para m&iacute;, <a href="../../introduccion-a-prolog-tutorial-en-espanol">SWI Prolog</a>.</li>
<li>Si en el anterior Teletexto presentaba TerminusDB, en este presento <a href="https://dgraph.io/">Dgraph</a>, una base de datos de grafos (por tanto similar a Neo4J y tambi&eacute;n a TerminusDB). Usa un lenguaje de consulta similar a GraphQL.</li>
<li>Acabamos el Teletexto, con <a href="https://hakibenita.com/sql-dos-and-donts">12 consejos para escribir SQL libre de fallos y con m&aacute;s rendimiento</a>.</li>
<li>Finalmente la canci&oacute;n de este Teletexto es Canci&oacute;n Consumo de Luis Eduardo Aute:</li>
</ul>
<p style="text-align: center;"><iframe src="https://www.youtube-nocookie.com/embed/j_VnOTWTnZY" width="560" height="315" frameborder="0" allowfullscreen=""></iframe></p>
<p style="text-align: center;">&nbsp;</p>