<p>Memento mori. En la Antigua Roma, cuando un general ven&iacute;a victorioso de una campa&ntilde;a, se le organizaba un desfile por las calles de Roma. Lanzaban v&iacute;tores y proclamas en su honor. No obstante, al lado de &eacute;l hab&iacute;a un siervo, que le iba repitiendo constantemente <em>las limitaciones de la naturaleza humana, con el fin de impedir que incurriese en la soberbia y pretendiese, a la manera de un dios omnipotente, usar su poder ignorando las limitaciones impuestas por la ley y la costumbre. (Wikipedia)</em>. Esto se resume en un aforismo, Memento Mori, "Recuerda que vas a morir". Este chorro de realidad nos devuelve a la humildad, y a la vez, si uno lo piensa, nos deja entrever que los problemas de ahora no son tan importantes como muchas veces creemos que son.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://files.adrianistan.eu/QuoVadis.jpg" alt="" /></p>
<p style="text-align: center;"><em>Fotograma de la pel&iacute;cula Quo Vadis, el esclavo le repite al general "Memento Mori". Personalmente, fue al ver esta pel&iacute;cula cuando supe de la existencia de esta tradici&oacute;n.</em></p>
<p style="text-align: left;">Hace unas semanas estuve en la Tech Party de Madrid. All&iacute; escuch&eacute; algo que ha retumbado en mi mente, por ser f&aacute;cil de entender y a la vez, por las consecuencias que conlleva. <strong>Tu c&oacute;digo va a morir</strong>.</p>
<p style="text-align: left;">Es cierto, por muy bueno que sea tu c&oacute;digo, alg&uacute;n d&iacute;a morir&aacute;. Por muy malo que sea, tambi&eacute;n morir&aacute; (aunque quiz&aacute; no lo suficientemente r&aacute;pido dir&aacute;n algunos). No te creas que por haber escrito el mejor c&oacute;digo de la historia, mereces un reconocimiento especial. No creas que por usar ese framework de moda con ese nuevo lenguaje, vas autom&aacute;ticamente a ser mejor, alguien digno de aplauso y recuerdo colectivo. Al final el c&oacute;digo morir&aacute; y algo m&aacute;s moderno lo reemplazar&aacute; igualmente, quiz&aacute; incluso ya no exista la raz&oacute;n de ser de ese software.</p>
<p style="text-align: left;">Tampoco pienses que el c&oacute;digo debe ser perfecto, busca la calidad, evidentemente, pero al&eacute;jate del perfeccionismo. En ocasiones <a href="http://blog.koalite.com/2019/05/no-corrijas-ese-bug/">ciertos bugs es mejor que esten presentes de forma cr&oacute;nica en un software</a>, como si de una enfermedad, en ocasiones molesta pero leve, se tratase. Tu c&oacute;digo debe madurar a buen ritmo, como un beb&eacute;, que poco a poco asume m&aacute;s responsabilidades y tareas, sin que ello le ocasione un desequilibrio interno (algo t&iacute;pico de familias desestructuradas). "Buen ritmo", eso quiere decir que no podr&aacute;s trabajar en ello indefinidamente, si quieres que sea &uacute;til, alg&uacute;n d&iacute;a deber&aacute;s poder decir que est&aacute; listo. Y si no, piensa que t&uacute; tambi&eacute;n morir&aacute;s y no podr&aacute;s acabarlo.&nbsp;</p>
<p style="text-align: left;">En ocasiones, la gente dice: "yo morir&eacute;, pero es software libre, alguien lo tomar&aacute;", "la empresa lo seguir&aacute; usando". Y aunque supongo que podr&iacute;a darse el caso, la gran mayor&iacute;a de los sistemas, de las comunidades, acaban siendo reemplazadas por otras. Es el ciclo vital. Recuerda que no eres excepcional, lo m&aacute;s probable es que lo que hagas no tenga un gran impacto. Ser&aacute; olvidado. No le des m&aacute;s importancia al c&oacute;digo de la que tiene.</p>
<p style="text-align: left;">Y esto no lo digo para desanimarte o para hacerte creer que lo que haces no vale nada. Al contrario, te lo digo para que te liberes. Para romper las cadenas que te ata, muchas veces de forma subconsciente, ese deseo de perdurar en la eternidad. Ese deseo de destacar, de producir el c&oacute;digo perfecto. Pero recuerda, al final, somos m&aacute;s bien como esas l&aacute;grimas, que se perder&aacute;n en la lluvia. Y no habr&aacute; que atormentarse por ello.</p>