<p>En este blog no he hablado mucho sobre videojuegos. Me gustan mucho, pero &uacute;ltimamente no juego tanto como anta&ntilde;o. Eso s&iacute;, cuando juego, suelo estar bastante tiempo. En la &eacute;poca de verano sin embargo, encuentro m&aacute;s tiempo para jugar. Hasta hace bastante tiempo no ten&iacute;a un <a href="https://e-sport.tech/requisitos-counter-strike-go/">tipo de PC</a> acorde a las exigencias de los juegos actuales. Hace unos a&ntilde;os me constru&iacute; un PC que ya me permit&iacute;a jugar a bastantes triple A.</p>
<p>Tiene un procesador AMD FX-4350 y una gr&aacute;fica AMD R7 250. De RAM pusimos 8 GB y de disco ten&iacute;a 1 TB de tipo HDD. No era lo mejor del momento, pero entraba dentro de nuestro presupuesto. El ordenador ha cumplido mis expectativas y me ha permitido jugar a los juegos que quer&iacute;a, cuando y como quer&iacute;a. En este art&iacute;culo os voy a comentar algunos de los juegos que juego en verano. Por supuesto, m&aacute;s pronto que tarde necesitar&aacute; una renovaci&oacute;n, con los &uacute;ltimos procesadores de AMD y las gr&aacute;ficas de NVIDIA, que rompen r&eacute;cords cada vez que se presentan. Tambi&eacute;n he podido comprobar la potencia de los SSD, que dentro de poco se convertir&aacute;n en algo obligatorio.</p>
<p>La mayor&iacute;a de los juegos de la lista son compatibles con ordenadores bastante asequibles, no necesitar&aacute;s un ordenador gaming de &uacute;ltima generaci&oacute;n para poder jugar satisfactoriamente a ellos.</p>
<h3>Starcraft II</h3>
<p><img src="https://files.adrianistan.eu/Starcraft.jpg" alt="" /></p>
<p>Leyendo las noticias de inteligencias artificiales como DeepMind que juegan al juego me entr&oacute; curiosidad. Hab&iacute;a jugado al primero unas pocas horas, as&iacute; que sab&iacute;a un poco por donde iba. No obstante, aprovechando que ahora es gratuito, convertido en free to play, me atrev&iacute; a ponerme m&aacute;s en serio con este juego. Se trata de uno de los juegos m&aacute;s importantes de la esfera de los e-sports. No obstante, yo empec&eacute; con la campa&ntilde;a gratuita, que es un buen tutorial. Luego pas&eacute; a partidas multijugador 1vs1. El ritmo es diferente, es mucho m&aacute;s fren&eacute;tico, si no eres r&aacute;pido, te comen. Siendo yo una persona m&aacute;s acostumbrada a ir m&aacute;s lentamente, construyendo las bases m&aacute;s detenidamente, me ha costado un poco entender la mentalidad. Todav&iacute;a soy muy malo y fuera de la campa&ntilde;a es dif&iacute;cil de aprender mec&aacute;nicas avanzadas.</p>
<h3>Factorio</h3>
<p><img src="https://files.adrianistan.eu/Factorio.jpg" alt="" /></p>
<p>Factorio es un juego de automatizaci&oacute;n industrial. La idea es muy simple, pero tremendamente potente. Tienes que ir construyendo cosas, como si fuese una gran cadena de montaje. El objetivo es construir un cohete bastante complejo pero eso es lo de menos. Lo adictivo es intentar hacer tu f&aacute;brica lo m&aacute;s eficiente y productiva posible. Un juego muy recomendable para programadores. Existe modo de juego pac&iacute;fico y con enemigos. Recomiendo empezar con el pac&iacute;fico para saber de que va la cosa, y luego pasarse a enemigos, que es m&aacute;s interesante.</p>
<h2>Cities Skylines</h2>
<p><img src="https://files.adrianistan.eu/CitiesSkylines.jpg" alt="" /></p>
<p>Cities Skylines es el city builder por excelencia de esta generaci&oacute;n. Con una cantidad ingente de mods y DLCs, el juego completo es impresionante y me gusta bastante. Respecto a la simulaci&oacute;n... A nivel econ&oacute;mico y de satisfacci&oacute;n de la gente es muy f&aacute;cil y lo &uacute;nico interesante es a nivel tr&aacute;fico (no es casualidad que est&eacute; hecho por una empresa que se dedicaba a hacer juegos de transporte). No obstante, por defecto la gesti&oacute;n del transporte es justamente un poco mediocre. Por otro lado la calidad visual es muy buena.</p>
<h3>Enter the Gungeon</h3>
<p><img src="https://files.adrianistan.eu/EnterTheGungeon.jpg" alt="" /></p>
<p>Enter the Gungeon es un juego roguelike muy entretenido. Con contenido a rabiar (armas, salas, enemigos, objetos,...), la mec&aacute;nica del juego es simple. Dispara y que no te den (sobre todo m&aacute;s lo segundo). Tiene un toque de humor que me encanta y el juego internamente es complejo, aunque no lo parezca. Debo decir que todav&iacute;a no lo he acabado pero me sigue entreteniendo aunque nunca pase del cuarto piso.</p>
<h3>Batman: Arkham Asylum</h3>
<p><img src="https://files.adrianistan.eu/Batman.jpeg" alt="" /></p>
<p>Batman: Arkham Asylum es un triple A con unos a&ntilde;itos ya. Batman es mi superh&eacute;roe favorito (por no decir, el &uacute;nico que tolero) y ten&iacute;a ganas de probar este juego. Se trata de un juego de acci&oacute;n, sigilo y combate cuerpo a cuerpo en tercera persona. Me sorprendi&oacute; gratamente, una ambientaci&oacute;n perfecta, una historia interesante y una jugabilidad muy potente.</p>
<h3>Dirt 3</h3>
<p><img src="https://files.adrianistan.eu/Dirt3.jpg" alt="" /></p>
<p>Dirt 3 es uno de los mejores juegos de carreras que he podido jugar. Principalmente son carreras de rally, las cu&aacute;les son ligeramente diferentes. En primer lugar, suelen ser punto a punto, es decir, nunca repites la misma curva y adem&aacute;s se intenta que no te la puedas llegar a aprender. En segundo lugar, son cronometradas, pocas veces tendr&aacute;s que adelantar. El juego propone una conducci&oacute;n bastante realista (sin llegar a ser una simulaci&oacute;n), con buenas f&iacute;sicas. Bastante contenido, con montones de coches de las marcas cl&aacute;sicas: Renault, Lancia, Mitsubishi, Mini, Peugeout, BMW, Subaru, ... Yo me pas&eacute; la campa&ntilde;a con marchas manuales y se lo recomiendo a todo el mundo, ya que es muy satisfactorio (en F1 puede ser m&aacute;s deseperante). El juego tambi&eacute;n tiene pruebas de circuito y de drifting, las cu&aacute;les no son tan buenas pero son minoritarias. En definitiva, un buen juego para quemar adrenalina, a velocidades tan bajas que te sorprender&aacute;s.</p>
<h3>Theme Hospital</h3>
<p><img src="https://files.adrianistan.eu/ThemeHospital.jpg" alt="" /></p>
<p>Este juego es quiz&aacute; el m&aacute;s antiguo de esta lista, de hecho si lo compr&aacute;is en GOG, lo recibir&eacute;is empaquetado junto con DOSBox para que funcione correctamente. Theme Hospital es un juego de tipo tycoon (gesti&oacute;n empresarial). En este caso estamos ante uno de los mejores t&iacute;tulos del g&eacute;nero, donde gestionamos un hospital. El juego no pretende ser serio, de hecho todas las enfermedades son inventadas y est&uacute;pidas pero es entretenido y llegado a un punto, puede llegar a suponer un reto lograr que no te despidan. Juego muy creativo, en jugabilidad ha envejecido bien, pero hay algunos detalles un poco arcaicos.</p>
<h3>Tr&oacute;pico 5</h3>
<p><img src="https://files.adrianistan.eu/Tropico.jpg" alt="" /></p>
<p>Tr&oacute;pico es una saga de city builders, mismo g&eacute;nero que Cities Skylines, pero con otro enfoque, radicalmente diferente. En Tr&oacute;pico gestionamos una isla tropical siendo presidentes de esta. Aqu&iacute; la pol&iacute;tica es m&aacute;s importante, ya que inspir&aacute;ndose en ciertas dictaduras, deber&aacute;s mantenerte en el poder. Dentro de la isla habr&aacute; facciones, que tendr&aacute;s que contentar y podr&aacute; haber rebeldes, que podr&aacute;n iniciar la revoluci&oacute;n. Para ello, t&uacute; que eres precavido, habr&aacute;s construido un ej&eacute;rcito lo suficientemente fuerte, con un salario aceptable. Adem&aacute;s organizar&aacute;s elecciones falsas para dar apariencia de democracia. El juego tiene un fant&aacute;stico sentido del humor y Tr&oacute;pico 5 mejor&oacute; mucho la jugabilidad respecto al 3 (el anterior que he jugado). Por otro lado, cabe destacar la escala del juego. Si en Cities Skylines las ciudades son de cientos de miles de habitantes, en Tr&oacute;pico con una isla de 150 habitantes ya tendr&aacute;s bastantes problemas. Es un juego mucho m&aacute;s individualizado, donde cada persona importa. Adem&aacute;s en la versi&oacute;n 5, la historia del mundo influye.</p>
<h3>Mini Metro</h3>
<p><img src="https://files.adrianistan.eu/MiniMetro.jpg" alt="" /></p>
<p>Mini Metro es un juego sencillo donde tenemos que ir construyendo l&iacute;neas de metro. El juego tiene una est&eacute;tica totalmente minimalista, que junto a su mec&aacute;nica simple hace que sea muy f&aacute;cil aprender a jugar. Sin embargo, la dificultad de este juego seg&uacute;n avanza el tiempo no es balad&iacute; y en alg&uacute;n momento perder&aacute;s (se pierde cuando una estaci&oacute;n est&aacute; colapsada). Juego muy simple pero entretenido al que le he echado muchas horas. Como punto negativo, el ritmo. Al empezar el juego es demasiado simple y aburrido, para luego ya ponerse interesante. La intensidad no es nada regular.</p>
<p>&nbsp;</p>
<h3>El resto</h3>
<p>Hay juegos que he jugado este verano que se quedan fuera de la lista, principalmente porque no me han gustado tanto. Algunos de ellos, sin orden en particular: F&oacute;rmula 1 2015, The Sexy Brutale, Super Meat Boy, Counter-Strike: GO, Fortnite, Maldita Castilla, Civilization V, Borderlands, ...</p>
<p>Como siempre, cualquier aportaci&oacute;n es bienvenida en los comentarios. Un saludo y hasta otro d&iacute;a.</p>