<p>Ya hemos visto tres componentes de la Web Sem&aacute;ntica: RDF, RDF Schema y SPARQL. Sin embargo, todav&iacute;a no hemos sido capaces de hiperconectar la informaci&oacute;n presente en diferentes servidores. La especificaci&oacute;n <a href="https://www.w3.org/TR/ldp/">Linked Data</a>, nos da unas pautas a seguir sobre como usar HTTP para conseguir que todo est&eacute; hiperconectado. Adem&aacute;s veremos el concepto de SOLID, que propuso Tim Berners-Lee para que la ciudadan&iacute;a recuperase el poder sobre sus datos en la web.</p>
<p><img src="https://files.adrianistan.eu/LinkedData.png" alt="" /></p>
<h2>Linked Data</h2>
<p>Lo primero que hay que tener en cuenta es que Linked Data nos define ciertas restricciones , entre otras, las IRI deber&aacute;n ser Web IRI, eso quiere decir que tienen que usar HTTP o HTTPS obligatoriamente como protocolo. Esto es as&iacute;, porque un concepto clave es la&nbsp;<strong>dereferenciaci&oacute;n</strong>. Es decir, dado un identificador, poder acceder al recurso en bruto. Esto es sencillo en recursos digitales, simplemente usa la direcci&oacute;n web donde est&aacute; el recurso, pero en recursos f&iacute;sicos o conceptos abstractos es complicado. Por eso se distingue entre la direcci&oacute;n web del recurso y las de la informaci&oacute;n. Pongamos un ejemplo sencillo, la receta de la tarta de Santiago.</p>
<p>Podemos definir una IRI para el recurso tal que as&iacute;: https://adrianistan.eu/recipe/tarta-santiago. En las tripletas que usen la tarta de Santiago usaremos ese identificador de recurso. &iquest;Pero qu&eacute; debe de hacer el servidor cuando accedamos a ese recurso con un GET de HTTP? En primer lugar, nuestra petici&oacute;n vendr&aacute; acompa&ntilde;ada de un campo Accept que deber&aacute; indicar el formato que queremos leer. Si es una m&aacute;quina podemos pedir XML, JSON-LD o Turtle. Si es un humano podemos indicar HTML. Entonces, el servidor manda una respuesta <strong>HTTP 303 See other</strong>, indicando la URL a la que tenemos que acceder ahora, en el formato correcto. As&iacute;, desde una aplicaci&oacute;n que pieda JSON-LD tendr&iacute;amos una redirecci&oacute;n:</p>
<p>http://adrianistan.eu/recipe/tarta-santiago -&gt; http://adrianistan.eu/recipe/tarta-santiago.json</p>
<p>Y ya podr&iacute;amos acceder a la informaci&oacute;n. Si en cambio, queremos leer la receta en formato humano la redirecci&oacute;n ser&iacute;a as&iacute;:</p>
<p>http://adrianistan.eu/recipe/tarta-santiago -&gt; http://adrianistan.eu/recipe/tarta-santiago.html</p>
<p>Seg&uacute;n los formatos que queramos leer tendremos una URL diferente, pero el IRI ser&aacute; el mismo siempre.</p>
<p>Una plataforma LinkedData completa debe ofrecer una serie de servicios para todos los verbos HTTP: GET, PUT, PATCH, HEAD, OPTIONS, DELETE, POST. De este modo se pueden dise&ntilde;ar APIs basadas en LinkedData. Sin embargo, este sistema no ha tenido mucho &eacute;xito y no voy a explicarlo en detalle.</p>
<h2>SOLID</h2>
<p><a href="https://www.genbeta.com/actualidad/tim-berners-lee-anuncia-solid-proyecto-open-source-internet-descentralizado-buenas-intenciones-algo-utopia">En 2018</a>, Tim Berners-Lee, padre de la web, propuso SOLID, un proyecto para restablecer el poder de los usuarios en la web. SOLID significia Social Linked Data y es una aplicaci&oacute;n de las t&eacute;cnolog&iacute;as de Linked Data para tratar de promover un sistema descentralizado. Podemos pensar en Solid como una especie de pincho USB. Esto son los&nbsp;<strong>pod</strong>. La gente tiene sus propios pods, ya sea autogestionados, o en sitios como los&nbsp; de correo electr&oacute;nico. Un pod no es m&aacute;s que un espacio de almacenamiento, pero fundamentado sobre las ideas de Linked Data. As&iacute;, nuestro pod contiene todos nuestros datos (a trav&eacute;s de RDF) de cada aplicaci&oacute;n y datos personales. Cuando una aplicaci&oacute;n quiere acceder a nuestros datos, le podemos dar permiso desde nuestro pod para que acceda la informaci&oacute;n que consideremos oportuna. Al usar Linked Data y RDF, diversas aplicaciones son capaces de usar los mismos datos sin cambiar de formato.</p>
<p><img src="https://files.adrianistan.eu/SOLID.png" alt="" /></p>
<p>Le deseo mucha suerte al proyecto SOLID, aunque no ha tenido mucho apoyo por parte de los desarrolladores. En parte el proyecto es bastante ut&oacute;pico, no es tan f&aacute;cil que todas las empresas dejen sus datos y hagan las transici&oacute;n a SOLID tan f&aacute;cilmente, solo ofrece ventajas para los usuarios, no para las empresas. Por otro lado, Linked Data nunca ha sido popular fuera de ambientes acad&eacute;micos o cient&iacute;ficos (al parecer estas tecnolog&iacute;as se usan bastante en biomedicina), la mayor&iacute;a de desarrolladores no conoce bien la tecnolog&iacute;a y apenas existen librer&iacute;as. Proyectos de software libre populares como Mastodon o PeerTube ni siquieran soportan SOLID.</p>
<p>Por otro lado, la transici&oacute;n a PODs por parte de los usuarios no es trivial y requiere de ense&ntilde;ar a los usuarios y a que sean conscientes de administrar sus propios pods.</p>
<p>He estado pensado sobre esto &uacute;ltimamente y creo que aunque la idea es buena tiene problemas pr&aacute;cticos. Pero, &iquest;y si combinamos los pods de SOLID con IPFS? &iquest;Y si SOLID se integrase en los navegadores? Yo mientras tanto voy a ir experimentando con esta tecnolog&iacute;a en futuros proyectos.</p>